{
   "date": "August 13, 2017",
   "dateChanged": "2017-08-13 05:23:51 +02:00",
   "image": {
      "enabled": true,
      "src": "http://www.tolleetlege.com/wp-content/uploads/2015/05/Edited_Lorenzo_Veneziano_Christ_Rescuing_Peter_from_Drowning._1370_Staatliche_Museen_Berlin.-copy.jpg",
      "layout": "left",
      "size": 62.5
   },
   "title": "Nineteenth Sunday in Ordinary Time",
   "text": "Bible scholars show us that Matthew\norganized the material of his gospel into five\nsections. This Sunday’s passage is part of the\nfourth section (13:54-18:35) in which he\nexplains the meaning of Jesus in relation to\nthe church. This section, as well as the entire\ngospel, reaches its fulfillment when the Risen\nLord commissions his disciples to make\ndisciples of all nations. And with the\nmandate he makes a promise: “Behold, I am\nwith you always, until the end of the age”\n(Mt 28:18-20).\n\nIn Matthew’s inspired theology, the divine\npresence in human history unfolds in three\nstages: (1) God forms the people of Israel\nand remains with them in good times and bad; (2) in fulfillment of divine promise through the prophets, Jesus, Messiah and\nincarnate Son of God, is present among his people as their savior; (3) in these last days, the Risen Lord, through his\ndisciples, is present to extend his saving mission beyond his particular historical time and land to all nations. The primary\nfocus of Matthew’s theology is to give us some insight into the meaning of the presence of the Risen Lord in the church by\nexamining the meaning of the divine presence in the prior stages of our sacred history.\nIn today’s gospel passage, while his disciples depart in a boat, Jesus goes up on a mountain by himself to pray. When a\nstorm arises during the night, Jesus comes toward the boat walking on the water. The disciples are terrified. Jesus reassures\nthem by his presence. Peter gets out of the boat and begins to walk on the water toward Jesus. Soon he becomes frightened\nand begins to sink. Jesus saves him and says: “O you of little faith, why did you doubt?” The disciples in the boat exclaim:\n“Truly, you are the Son of God.”\n\nThe images Matthew uses are powerful in their direct simplicity—disciples in a boat, night, stormy waters. We can readily\nidentify with the reality to which these images point both as church and as individuals. The church in every age is threatened\nby the chaos of evil (the night) and the powers of death (the stormy waters). Matthew assures us with the good news that the\nRisen Lord with “all power in heaven and on earth” is present to save, just as Yahweh, with mastery over all the forces of\nnature, saved a slave-people from the powers of death in Egypt. Jesus’ self-identification (“It is I”) of Matthew 14:27, just as\nthe “I am” of Exodus 3:14, means “I am here to save you. Do not be afraid.”\n\nThe one constant in the drama of the divine presence in history is the necessity of human response to the saving presence\nwith total trust. The disciples are like most of us -- we believe that the Lord is with us, but our trust is quite conditional. We\ntend to panic when a sudden storm arises in the middle of the night, and things get out of control. Like Peter we may start\nout with confidence, but soon we notice that the wind is really strong and the water is really deep. Our confidence turns to\nfear. Today’s gospel assures us that Jesus also stretches out his hand to save us with those words that must have been spoken\nwith affection: “O you of little faith, why did you doubt?”\n\nAnother life implication emerges if we shift our focus from the disciples to Jesus. Matthew notes that before the episode on\nthe stormy sea, Jesus had gone up on a mountain by himself to pray. Jesus’ humanity, through intimate communion of prayer\nwith the Father, is completely transparent so that divine power flows through him to overcome the destructive powers of\nevil.\n\nAs Christians we are not meant to be helpless victims when storms threaten to destroy us. We too are called to be in close\ncommunion of prayer with the Father so that with Christ’s courage and love we can confront the powers of destruction in\nour world. In this regard, we might take to heart that astonishing passage in the fourth gospel: “ . . . whoever believes in me\nwill do the works that I do, and will do greater ones than these, because I am going to the Father” (Jn 14:12).",
   "father": "Welcome Father Peter",
   "source": "Souce: Campion P. Gavaler, O.S.B.; http://www.saintvincentarchabbey.org/news_print?id=3365\nImage: Lorenzo Veneziano, Christ Rescuing Peter from Drowning. 1370 Staatliche Museen, Berlin",
   "reading1": "1 Kgs 19:9, 11-13",
   "reading2": "Rom 9:1-5",
   "reading3": "Mt 14:22-33",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [],
   "colors": {
      "color1": "#3BBD00",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Serif",
         "lineHeight": 14,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2017-08-13-nineteenth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2017-08-13-nineteenth-sunday-in-ordinary-time.markdown"
}