{
   "date": "August 27, 2017",
   "dateChanged": "2017-08-25 07:05:31 +02:00",
   "image": {
      "enabled": true,
      "src": "https://artandliturgy.files.wordpress.com/2017/05/art-and-liturgy-pietro-perugino-delivery-of-the-keys-1482.jpg?h=436&w=723",
      "layout": "left",
      "size": 50
   },
   "title": "Twenty-First Sunday in Ordinary Time",
   "text": "Peter was to be entrusted with the keys of the Church, or rather, he was entrusted with the keys of heaven; to him would be committed the whole people of God. The Lord told him: “Whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven.”\n\nNow Peter was inclined to be severe, so if he had also been impeccable what forbearance would he have shown toward those he instructed? His falling into sin was thus a providential grace to teach him from experience to deal kindly with others.\n\nJust think who it was whom God permitted to fall into sin—Peter himself, the head of the apostles, the firm foundation, the unbreakable rock, the most important member of the Church, the safe harbor, the strong tower; Peter, who had said to Christ, “Even if I have to die with you I will never deny you”; Peter, who by divine revelation had confessed the truth: “You are the Christ, the Son of the living God.”\n\nThe Gospel relates that on the night that Christ was betrayed Peter went indoors and was standing by the fire warming himself when a girl accosted him: “You too were with that man yesterday,” she said. But Peter answered: “I do not know the man.”\nJust now you said: “Even if I have to die with you,” and now you deny him and say: “I do not know the man.” Oh Peter, is this what you promised? You were not tortured or scourged; at the words of a mere slip of a girl you took refuge in denial!\n\nAgain the girl said to him: “You too were with that man yesterday.” Again he answered: “I have no idea what man you mean.”\n\nWho was it that spoke to you, causing you to make this denial? Not some important person but a woman, a doorkeeper, an outcast, a slave, someone of no account whatever. She spoke to you and you answered with a denial.\n\nWhat a strange thing—a girl, a prostitute, accosted Peter himself and disturbed his faith! Peter, the pillar, the rampart, could not bear the threat of a girl! She had but to speak and the pillar swayed, the rampart itself was shaken!\n\nA third time she repeated: “You too were with that man yesterday,” but a third time he denied it. Finally Jesus looked at him, reminding him of his previous assertion. Peter understood, repented of his sin, and began to weep. Mercifully, however, Jesus forgave him his sin, because he knew that Peter, being a man, was subject to human frailty.\n\nNow, as I said before, the reason God's plan permitted Peter to sin was because he was to be entrusted with the whole people of God, and sinlessness added to his severity might have made him unforgiving toward his brothers and sisters. He fell into sin so that remembering his own fault and the Lord's forgiveness, he also might forgive others out of love for them.\n\nThis was God's providential dispensation.\n\nHe to whom the Church was to be entrusted, he, the pillar of the churches, the harbor of faith, was allowed to sin; Peter, the teacher of the world, was permitted to sin, so that having been forgiven himself he would be merciful to others.",
   "father": "Welcome Father Peter",
   "source": "Source: http://liturgy.slu.edu/21OrdA082717/theword_journey.html\nSource: Peitro Perugino - Entrega de las llaves de San Pedro",
   "reading1": "Is 22:19-23",
   "reading2": "Rom 11:33-36",
   "reading3": "Mt 16:13-20",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1504994400000",
         "date": "10 September",
         "description": "Social gathering for next month comes off on September 10 as we will be celebrating our 4th anniversary of coming together as a community. As we look forward to this special day, we will kindly request for volunteers who may be present on that day and would be able to help with the organisation. More details will be  made available in the coming weeks in this regard."
      }
   ],
   "colors": {
      "color1": "#3BBD00",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 11,
         "size": 13,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2017-08-27-twenty-first-sunday-in-ordinary-time.html"
   },
   "saveAs": "2017-08-27-twenty-first-sunday-in-ordinary-time.markdown"
}