{
   "date": "April 15, 2018",
   "dateChanged": "2018-04-14 10:06:22 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Rembrandt_Harmensz._van_Rijn_023.jpg/800px-Rembrandt_Harmensz._van_Rijn_023.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Third Sunday of Easter",
   "text": "In the weeks following Easter the Church always reviews the story of its early growth, which is recorded implicitly in any number of New Testament books but most purposefully and clearly in the Acts of the Apostles. Starting with the first days after the resurrection and ascension of Christ the Acts recount how Christianity first rooted itself among the Jewish followers of our Lord who continued to worship near the Temple, praying and praising the risen Jesus as their savior (Acts 2:42-47). Two trends then emerge in Acts, reflecting the course of early Christianity, in which the faith attracted both further Jewish converts and many new gentile (pagan) adherents; today's first reading shows Saint Peter speaking to a crowd of his fellow Jews asking them to see that Jesus was the long-awaited messiah who fulfilled the promises made to the great patriarchs Abraham, Isaac, and Jacob. Peter next urges them to turn to Jesus even if they had rejected him before—as Peter himself had—and find newness of life in him: \"Repent, therefore, and be converted, that your sins may be wiped away\" (Acts 3:19). \n\nThis reminds us all that every person has the possibility for a new beginning in Christ, something we especially understand and rejoice in during the Easter season, filled as it is with rich imagery of resurrection and new life. Once we begin our life with Christ in a conscious and committed manner we are sustained by the grace of God which comes to us in a particular way through the sacraments of the Church, seen in special focus during the Easter season as many young children receive the sacrament of Reconciliation and their First Holy Communion, as Catholic youth and young adults receive the sacrament of Confirmation, and as the traditional season for weddings and ordinations opens. Strengthened through all these beautiful moments of grace, we resolve not to part from the one who has brought redemption and meaning to us. Today's second reading touches upon the question of how followers of Jesus find their way back when they do stray from the new life they share with him. \n\nWe hear the apostle John first exhort his disciples to abide with the Lord in an upright life: \"My children, I am writing this to you so that you may not commit sin.\" Next he assures us that we need not lose hope if the Christian journey proves too difficult for us and we fall short: \"But if anyone does sin, we have an Advocate with the Father, Jesus Christ the righteous one.\" Jesus, he tells us, will never abandon his faithful who come back to him after falling; rather, \"He is expiation for our sins, and not for our sins only but for those of the whole world.\" That is, Jesus gives all the chance for a new beginning just as surely as he gave Saint Peter a chance to recover from his denial of Christ during his passion (Mark 14:66-72). \n\nPeter makes good use of his \"new life\" in Christ by proclaiming his faith to his brethren. We need not be so bold as Peter in his apostolic preaching but we can show our appreciation for the new beginning we have by living in a consistently Christian manner, extending to others the same possibility of a second chance that we ourselves have received in him. In doing so we live, not in a self-assured illusion of sinlessness (1 John 1:8), but in the confidence that our redeemer loved us enough to die for us and to renew in us a share in his resurrection each time we fall, carrying us joyfully into the same movement of the conversion and growth of his holy people that began in the Acts of the Apostles. ",
   "father": "Welcome Father Peter",
   "source": "Source: Father Edward Mazich, O.S.B., http://www.saintvincentarchabbey.org/news_print?id=3683\nImage: Christ at Emmaus by Rembrandt, 1648, Louvre.",
   "reading1": "Acts 3:13-15, 17-19",
   "reading2": "1 John 2:1-5",
   "reading3": "Lk 24:35-48",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1523743200000",
         "date": "15 April",
         "description": "Invitation to join in praying the rosary every Sunday half an hour before Mass. The rosary group also reminds us that there is a book available at the back of the church to write down intentions you'd like them to pray for"
      }
   ],
   "colors": {
      "color1": "#CECA2F",
      "color2": "#000",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11.5,
         "paragraphMargin": 10
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Our bulletin for this Sunday's Mass is now online. Wishing you all a lovely weekend and hope to see you tomorrow.",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2018-04-15-third-sunday-of-easter.html"
   },
   "saveAs": "2018-04-15-third-sunday-of-easter.markdown"
}