{
   "date": "June 10, 2018",
   "dateChanged": "2018-04-15 09:28:12 +02:00",
   "image": {
      "enabled": true,
      "src": "https://i2.wp.com/indiancatholicmatters.org/wp-content/uploads/2017/11/forgiveness.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Tenth Sunday in Ordinary Time",
   "text": "**Fear and Forgiveness**\n\nThe fearful Gospel Reading says that there is an\nunforgivable sin. What is that?\n\nTo see the answer, consider [today's Psalm 130]: _out of\nthe depths I cry to you, O Lord! If you, O LORD, mark\niniquities, LORD, who can stand?_ Who doesn’t feel this\nway about his sins?\n\nAnd now notice how the Psalm continues: _But with you\nis forgiveness, that you may be revered_ — or, as\nanother translation has it, _that you may be feared_.\nWhy think that God forgives your sins so that you\nmight revere or fear him? Wouldn't it be more true to\nsay that you fear God because you worry about your\nsins? Wouldn’t you fear that if you faced God, your sins\nwould just seem worse because you would see them in\nthe light of God’s holiness?\n\nAnd yet look what the Psalm says: there is forgiveness with God! God's forgiveness can gentle you into a\nsurrender to God’s love, can’t it? If God himself loves you and forgives your sins, then wouldn’t you love God and\nwant to cleave to him? And so the Psalmist is right: there is forgiveness of your sins with God so that you might\nfear God - not with a fear of God’s punishing or forsaking you, but just with a fear of your own turning away from\nthe Lord who forgives you.\n\nBut, then, if God forgives you so that you might fear him, what sin of yours is unforgivable?\n\nYou can see the answer for yourself now, can't you?\n\nWhat happens if when God forgives you, you turn away from him instead of cleaving to him and fearing him? If\nyou turn away from God even when God forgives you, then there is nothing left that God can do for you, is there?\nThe gift of God’s forgiveness is there for you. But if you won’t open to receive it, then even God can’t give it.\n\nAnd what does a refusal to accept God’s forgiveness come to except a refusal to believe that the love and\nforgiveness of God are there, there for you too? In effect, a refusal of God’s forgiveness is a rejection of God as\nlove.\n\nAnd so the unforgivable sin is a permanent refusal to accept God’s forgiveness. But that refusal really is\nblasphemous against the Spirit of God, isn’t it? What does Scripture say? God is Love.",
   "father": "",
   "source": "Reflection by Eleonore Stump, http://liturgy.slu.edu/10OrdB061018/reflections_stump.html",
   "reading1": "Gn 3:9-15",
   "reading2": "2 Cor 4:13-5:1",
   "reading3": "Mk 3:20-35",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1528581600000",
         "date": "10 June",
         "description": "Our next opportunity to receive the **Sacrament of Penance and Reconciliation** aka confession is this Sunday, as\nusual after Mass. As a reminder, if need be our priests are always willing to celebrate this Sacrament with you at any other\nSunday as time allows before or after Mass."
      }
   ],
   "colors": {
      "color1": "#40B5BF",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12.5,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": false,
      "facebookMessage": "",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2018-06-10-tenth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2018-06-10-tenth-sunday-in-ordinary-time.markdown"
}