{
   "date": "November 11, 2018",
   "dateChanged": "2018-11-10 06:42:31 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Brooklyn_Museum_-_The_Widow%27s_Mite_%28Le_denier_de_la_veuve%29_-_James_Tissot.jpg",
      "layout": "left",
      "size": 62.5
   },
   "title": "Thirty-second Sunday in Ordinary Time",
   "text": "Though hesitant at first, the widow of Zarephath offers all that she has to the prophet Elijah, and is marvelously rewarded. Convinced she needed to hold onto the little she possessed, the prophet revealed to her that small actions and offerings made with humility can be of infinite value in the eyes of God, who sees not in human terms of prestige or wealth, but sincerity of heart.\n\nThe story of the “widow’s mite” from the gospel of Matthew confirms and deepens this teaching. There our Lord himself carefully observes members of the community placing contributions in the offering box in the temple, and dismisses the large contributions of some people as being of little value, since they were made from a comfortable surfeit of wealth. The poor widow’s two coins were worth only a small fraction of a day’s wages, yet Jesus recognizes their value to the woman, who had no other sustenance, and praised the woman’s trust in God’s providence in giving them.\n\nThis episode comes at the end of a long series of encounters with scribes, Pharisees, and Sadducees, all of whom had the common desire to rid themselves of Jesus and his troublesome reminders about true religion and worship. They wanted to appear observant and to receive the accolades of the public but had no desire to experience true conversion of heart.\n\nWhat the readings tell us today is that one cannot be a part-time disciple of Jesus, or a follower who is faithful when convenient. Religion became domesticated for the Pharisees and their cohorts, and it easily can become so for us as well. This happens when participation in parish life is limited to a bare hour per week, when financial support of the Church is conceded grudgingly, and when “going through the motions” sums up our Catholic spirituality and life.\n\nThis teaching applies to all Christians and in a special way to those who are given a public role in leading the Church. (...) This means that Church leaders must not revel in public recognition or wealth, or act like corporate executives more than ambassadors of Christ, or forget that the grace of ordination comes from the grace of baptism and one’s fundamental bond with all Christians in the waters of that holy sacrament.\n\nIn sum, like the passages which precede it, this gospel calls us to think in a Kingdom of God centered way rather than prioritizing the possessions and praise esteemed by our worldly culture. (...) may we seek what is of abiding value—what is genuinely of the Kingdom—so that together with the poor widow of Zarephath and the widow we met in the temple treasury we might be counted among those who live with firm trust in God, and hope in the coming of his Kingdom. Then, as a community born of baptism and centered around the Eucharist, we will best be able to respond to our calling to “go forth and make disciples of all the nations” (Matt 28:19).",
   "father": "Welcome Father Peter",
   "source": "Source of reflection: Edward Mazich, O.S.B., http://saintvincentarchabbey.org/2015/11/08/thirty-second-sunday-of-the-year-modern/\nSource of image: James Tissot, \"The Widow's Mite\", between 1886 and 1894 (PD-US-1923)",
   "reading1": "1 Kgs 17:10-16",
   "reading2": "Heb 9:24-28",
   "reading3": "Mk 12:38-44",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1541890800000",
         "date": "11 November",
         "description": "Monthly opportunity to receive the Sacrament of Penance and Reconciliation after Mass."
      }
   ],
   "colors": {
      "color1": "#4085BF",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, our bulletin for this Sunday is now online! After Mass: opportunity to receive the Sacrament of Penance and Reconciliation.",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2018-11-11-thirty-second-sunday-in-ordinary-time.html"
   },
   "saveAs": "2018-11-11-thirty-second-sunday-in-ordinary-time.markdown"
}