{
   "date": "May 12, 2019",
   "dateChanged": "2019-05-11 09:59:26 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Good_shepherd_icon.jpg",
      "layout": "left",
      "size": 35
   },
   "title": "Fourth Sunday of Easter",
   "text": "***“My sheep hear my voice;\nI know them, and they follow me.***\n\nJesus, judging from his stories, paid a lot of attention to animals. He had watched shepherds and sheep many times in his trips through the lands and he observed their kinship, one for the other. (...) Shepherds made the sheep safe, guarded them, and led them to food and drink. Jesus even compared a milling crowd of people to “sheep without a shepherd” (Mt 9:36).\n\nI have been told that in the Jerusalem of Jesus’ day various flocks would arrive along with their respective shepherds, but that there was only one sheepfold (the pen for sheep), so all the shepherds sent all the sheep into it. This made for a rather large herd overall, and there wasn’t a practice of branding or marking in order to tell one from the other. What's more, sheep, unlike dogs, do not rejoice themselves into knots when their shepherd walks in.\n\nThen how could each shepherd reclaim own sheep?\n\nTwo ways.\n\nFirst, the shepherd knew them by heart. Sometimes he had a special name for each character in the flock. And second, the sheep themselves recognized their master’s voice immediately. When he called out, they simply got to their feet and came with him, through the sheep-gate.\n\nJesus refers to this familiarity in Sunday’s short Gospel reading. “My sheep hear my voice; I know them and they know me,” he says. Haven’t you ever longed to hear the voice of someone who could make things alright, who could lift the burdens from your shoulders? Someone who knows you by name and loves you?\n\nJesus says he is that someone.\n\nYou “shall never perish,” he adds, as he holds you in his own hands. It is the Father who has given you to Jesus. Who could revoke that gift?\n\nI have a hunch that you do recognize Jesus’ voice when you hear it. Your feelings move when you hear trustingly a certain gospel, for instance. Or when you receive the bread of everlasting life and the cup of unending salvation—not as a stranger might, but as a member of the well-fed and greatly cared for flock.\n\nWhat about trying, this Sunday, to notice whether your spirit inclines to Jesus? Maybe you settle into his lap for care.\n\nYour soul seeks him always.\n\nAnd he finds you.",
   "father": "Welcome Father Peter",
   "source": "Reflection by Fr. John Foley, SJ (shortened) - http://liturgy.slu.edu/4EasterC051219/reflections_foley.html\nImage: Icon of The Good Shepherd - https://commons.wikimedia.org/wiki/File:Good_shepherd_icon.jpg",
   "reading1": "Acts 13:14, 43-52",
   "reading2": "Rev 7:9, 14B-17",
   "reading3": "Jn 10:27-30",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1557612000000",
         "date": "12 May",
         "description": "After mass, we are invited to make use of this month's opportunity to receive the **Sacrament of Reconciliation**."
      }
   ],
   "colors": {
      "color1": "#D2B379",
      "color2": "#862D2D",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, find our bulletin for this Sunday, May 12, on our website now - enjoy reading it!\nThis being the second Sunday of the month, opportunity to celebrate the Sacrament of Reconciliation is scheduled after mass.",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2019-05-12-fourth-sunday-of-easter.html"
   },
   "saveAs": "2019-05-12-fourth-sunday-of-easter.markdown"
}