{
   "date": "September 15, 2019",
   "dateChanged": "2019-09-14 11:51:27 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Return_of_the_Prodigal_Son_1667-1670_Murillo.jpg/1134px-Return_of_the_Prodigal_Son_1667-1670_Murillo.jpg",
      "layout": "left",
      "size": 45
   },
   "title": "24th Sunday in Ordinary Time",
   "text": "###The Prodigal Us###\n\n[...] In the First Reading we find God becoming quite upset because the people in ancient days put up cheap products as their God. While Moses is away, they have built a golden calf, and are making it their God. Ridiculous.\n\nGod had a different idea of his relation to the people. We could sum it up as follows:\n\nWhat about the two-way covenant of love I have been offering you? “I will be your God and you will be my people. I will love you more than you can ask or imagine. Won’t you just love me in return?”\n\nBut they refuse and willfully run away to their paltry desires. God becomes angry, maybe in the way a parent would with a seriously disobedient child. He shouts at Moses,\n\n*let me alone, then,\nthat my wrath may blaze up against them\nto consume them.* (First Reading)\n\nA few lines later, Moses acts as a family friend. He says,\n\n*Why, O Lord, should your wrath blaze up against your own people, whom you brought out of the land of Egypt with such great power and with so strong a hand? … Let your blazing wrath die down; relent in punishing your people.*\n\nJust calm down, Give them some time. God agrees.\n\nYet they were “worshipping” false gods! Maybe you and I do not exactly worship (fall down and adore) all the man-made items that demand our time, but have you ever run away from God so you can have whatever arouses your own addictions?\n\nFor sure the prodigal son (Gospel) did. He left what he felt were the \"shackles\" of home life and also the confining love from his father. He made himself “free”! He squandered everything on a life of dissipation, the equivalent of our many refrigerators, cars, houses, magazines and clothes.\n\nWhen he finally comes crawling back home, defeated, we would expect his father to say: “Oh sure, now you turn up, thinking everything will be just like it used to be. Well think again, pal.”\n\nBut instead his father actually runs to meet his son, embraces him and prepares a huge feast of welcome. Did the young man get what he deserved? No, he got what his father prepared for him. Entire forgiveness.\n\nGod does not want to keep us from the things that attract us. He wants us to value them in due proportion. Love God above all things. Then you can love everything and everyone else as they deserve.\n\nWe fail, of course, like the prodigal, and like the ancient Israelites did. So Jesus pleads for us, just as Moses pleaded. God puts his arms around us and says, “welcome, welcome, welcome. You came back! We can love one another again, can't we?”\n\nWe will do our best, we say.",
   "father": "Welcome Father Cyril",
   "source": "Source of reflection: Fr. John Foley, SJ - http://liturgy.slu.edu/24OrdC091519_1/reflections_foley.html\nSource of image: Bartolomé Esteban Murillo, \"The Return of the Prodigal Son\" (ca. 1670)",
   "reading1": "Ex 32:7-11, 13-14",
   "reading2": "1 Tm 1:12-17",
   "reading3": "Lk 15:1-32",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1568502061243",
         "date": "15 September",
         "description": "Opportunity to receive the **Sacrament of Reconciliation** after Mass!"
      }
   ],
   "colors": {
      "color1": "#408DBF",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, our newsletter summer break is over: Our bulletin for Sept 15 is now available online.\nAfter Mass this week: opportunity to receive the Sacrament of Reconciliation.",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2019-09-15-24th-sunday-in-ordinary-time.html"
   },
   "saveAs": "2019-09-15-24th-sunday-in-ordinary-time.markdown"
}