{
   "date": "September 29, 2019",
   "dateChanged": "2019-09-27 11:21:58 +02:00",
   "image": {
      "enabled": true,
      "src": "https://www.gracelutheranregina.com/df_media/W1siZiIsIjIwMTcvMDgvMjAvMTkvMDQvMDIvMTk0YzgwY2ItY2IxZC00Yjg2LTk0N2YtY2MxNWRiZDk3YzI5L0xhemFydXNSaWNoTWFuMDA4NTg3V0VCX182NTAwOS4xNTAwNDA1MDgxLjUwMC42NTkuZ2lmIl0sWyJwIiwidGh1bWIiLCI4MDB4Il1d/LazarusRichMan008587WEB__65009.1500405081.500.659.gif?sha=ac10d4494ae94c91",
      "layout": "left",
      "size": 50
   },
   "title": "26th Sunday in Ordinary Time",
   "text": "In today’s Gospel, Jesus tells the Pharisees a story. I stop short of saying “a story *about*” since that answer depends on one’s perspective. Is this a story about a rich man? Or is this a story about a poor man, Lazarus? Let’s start with the former.\n\nThe unnamed rich man in this story is surrounded by every material comfort he could want. Food, drink, clothing. He seemingly wants for nothing. And at his door is Lazarus, a poor man. Hungry, thirsty, sore-ridden. What’s more, the rich man sees him and knows he is deprived of even the most basic human needs. After both men have died, the rich man asks Abraham to “Send Lazarus” to comfort him. He knows by name the man who sat at his door, whom he chose not to help. Abraham has no pity on the rich man.\n\nBy contrast, seeing this as the story of the poor man, Lazarus, offers a different perspective. Wanting for even the most basic things, Lazarus seeks not even a meal at the rich man’s table but, rather, the scraps that fall. That dogs lick his sores seems to position these dogs as more caring of Lazarus than the rich man. Lazarus is meek, receives whatever may come his way, and is received into Heaven. \nSo, who is this story about? I submit that this story is not about one or the other. Instead, I read this story as being about each of us.\n\nEach of us may find ourselves as the rich man at certain times in our life and as Lazarus at others. Indeed, at their death the two men in this story switch places and experience one another’s previous state, in a way. In this story as well as others, the question of who is our neighbor – and how we should treat them – is fundamental. The Gospel is clear that we are all neighbors. Once we take ownership of this reality, internalizing it, action must follow. Jesus modeled and preached a way of worshipping God that was far from theoretical and certainly far from comfortable. While we may worship God in many ways, among them must be through our concrete actions in love for one another. *Amen, I say to you, whatever you did for one of these least brothers of mine, you did for me.* (Mt 25:40)\n\nLet us embrace this calling and embrace all whom we encounter as our neighbor.",
   "father": "Welcome Father Cyril",
   "source": "Source of reflection: Scott McClure, on Creighton University, https://onlineministries.creighton.edu/CollaborativeMinistry/092919.html\nSource of image: Icon of Lazarus and the Rich Man, found on https://www.gracelutheranregina.com/podcasts/media/2017-08-20-faith-is-the-difference-1st-sunday-after-trinity",
   "reading1": "Am 6:1A, 4-7",
   "reading2": "1 Tm 6:11-16",
   "reading3": "Lk 16:19-31",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1570312800000",
         "date": "6 October",
         "description": "**Social gathering**: Our monthly get-together after mass is a chance to share food and thoughts, and get to know your fellow parishioners better. Bring a dish for the buffet if possible!"
      },
      {
         "epoch": "1570917600000",
         "date": "13 October",
         "description": "Monthly opportunity to receive the **Sacrament of Penance and Reconciliation**, after mass."
      }
   ],
   "colors": {
      "color1": "#4095BF",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, our bulletin for September 29 is now online. We hope you enjoy reading it.\nHave a great weekend and join us in worship on Sunday!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2019-09-29-26th-sunday-in-ordinary-time.html"
   },
   "saveAs": "2019-09-29-26th-sunday-in-ordinary-time.markdown"
}