{
   "date": "October 13, 2019",
   "dateChanged": "2019-10-12 08:46:53 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/ChristCleansing.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Twenty-Eighth Sunday in Ordinary Time",
   "text": "The word of God today tells us that we all need to be grateful to God every day of our lives for the graces and good gifts we have received in and through him. He has not only given us our life with all its joys and sorrows, but he has prepared us a future life of joy and happiness. We often fail to acknowledge the good he has done to us. What is needed in our life is the recognition of the good and the acknowledgement of gratitude towards God and all persons who come to us as instruments of God. It is necessary for us to express our thanks to the one who has done so much for us and does for us even now. Therefore our lives should be one of thanksgiving and at the same time one of thanks living. Like Naaman, the Samaritan, and Paul, we should acknowledge God’s gifts and express our gratitude to him. On reflection this passage can say so much to us about our own lives. Leprosy, once such a terrifying disease has largely disappeared from many parts of the earth. But there are other situations like AIDS and other diseases together with poverty, immigrants and other unwanted people. As followers of Jesus, we need not only to be aware but to promote the dignity and rights of people who are “different” by reason of race, culture, religion or any physical or mental handicap. We need to see that for God there are absolutely no lepers, no outsiders. All are family, all have the same Father, all are his children, and all are brothers and sisters to each other.\n\nWe all are aware that we have been the recipients of gifts from God. In our life of faith an attitude of gratitude, that is to be thankful to God for everything he sends is essential and is a key to praying effectively. Our gratitude and words of thanks are indeed simple ways of showing appreciation for what we possess and all the blessings we have received. But the expression of gratitude is like all the other blessings must come from the depth of our hearts. Expressing an attitude of gratitude is more than giving words of thanks for the blessings. It is a way of living our life and being aware of how and why we are receiving these blessings. Being thankful to a person changes a person’s life and his orientation. Our expression of gratitude for all that we have received transforms our life and we feel and think in terms of abundance. Today’s word of God provides us with an opportunity to reflect upon our own disposition as we have received a gift of grace.",
   "father": "Welcome Father Cyril",
   "source": "Source: shortened from https://msjnov.wordpress.com/2019/10/06/twenty-eighth-sunday-october-13-2019/\nImage: Melchior Doze, Jesus cleansing a leper",
   "reading1": "2 Kgs 5:14-17",
   "reading2": "2 Tm 2:8-13",
   "reading3": "Lk 17:11-19",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1571522400000",
         "date": "20 October",
         "description": "This month's confessions have been moved to next week, October 20th. Kindly take note of this."
      }
   ],
   "colors": {
      "color1": "#3BBD00",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "As you read our bulletin for this week, be reminded that confessions this month comes of next week, October 20th.\n\nHave a blessed weekend!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2019-10-13-twenty-eighth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2019-10-13-twenty-eighth-sunday-in-ordinary-time.markdown"
}