{
   "date": "December 15, 2019",
   "dateChanged": "2019-12-14 10:41:32 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Giovanni_di_Paolo_-_Saint_John_the_Baptist_in_Prison_Visited_by_Two_Disciples_-_Google_Art_Project.jpg/138px-Giovanni_di_Paolo_-_Saint_John_the_Baptist_in_Prison_Visited_by_Two_Disciples_-_Google_Art_Project.jpg",
      "layout": "left",
      "size": 25
   },
   "title": "Third Sunday of Advent",
   "text": "Last week we heard about the ministry of John the Baptist and the text we read was taken from the very beginning of St Matthew's Gospel after the section we call the Infancy Narrative and just before the account of Jesus' Baptism.\n\nToday the Gospel jumps forward to Chapter Eleven and describes an incident which took place right in the middle of Jesus' public ministry. By this time, John the Baptist was languishing in prison and it wouldn't be too long before he lost his head at the hands of King Herod.\n\nJohn the Baptist wants to know if Jesus really is the Messiah whom he has prophesied about. So he sends his disciples to Jesus to quiz him and to discover if he was the one foretold. Jesus gives them this message to take to John the Baptist, 'the blind see again, and the lame walk, lepers are cleansed, and the deaf hear, and the dead are raise to life and the Good News is proclaimed to the poor.' These words would surely bring great joy and satisfaction to John the Baptist. On hearing them he would realise that his mission was now fulfilled, that the Messiah had truly come into the world.\n\nJesus then goes on to tell the people of the importance of John the Baptist. He acknowledges that John was a tough messenger who distained his own personal comforts for the sake of the message he came to proclaim. He tells them that there is no one greater than John the Baptist but adds the words, 'Yet the least in the kingdom of heaven is greater than he is.' By this Jesus emphasises the importance of heaven as the true goal of every follower of his. He stresses that those who ultimately gain admittance to the Kingdom are indeed blessed.\n\nHeaven is our true destiny, it is for this that we were created in the beginning. But God does not want us to arrive in heaven simply because it is our destiny. No, his desire is that we get to heaven as the result of exercising our own free will. He wants us to get to heaven because at a certain point in our lives we have made a decision and we chose to reject sin and to embrace his Gospel of love.\n\nWe can draw a useful distinction between us and the animals. The animals do not exercise free will, they live their lives at a purely instinctual level. There is a gradation, however, since some animals exist in a very primitive state and seem to operate at a very simple level. We could take the earthworm as an example. It simply lives in the soil feeding and excreting and mating and doing little else.\n\nOther animals such as the family dog seem to have much more about them. Dogs, for example, have a range of highly developed senses, they have a memory and they exhibit admirable qualities such as loyalty and they are even able to express emotions such as joy and sorrow.\n\nAlthough dogs can show expression through barking, which certainly conveys a certain level of meaning, they have not developed language which they would need in order to express a deeper range of feeling and thought. So although dogs are fine animals and make wonderful companions for us they do not have the capacity to exercise free will.\n\nThe exercise of free will requires self-consciousness as well as the ability to use language and to master higher thought. It is important that we are able to reflect on our state of being and be able to evaluate our actions and make decisions to adjust them as well as being able to adhere to a moral code of conduct.\n\nWithout these abilities we cannot make truly free choices in life and even with them we are sometimes subject to unconscious desires and other limitations which take a deal of effort to break free from. Humanity is certainly one of the greatest of God's creations and it is his desire that, when our time on this earth has come to an end, we are able to share in his life in the eternal realm.\n\nWe need to be also clear that when Jesus says that the least one in the Kingdom of Heaven is greater than John the Baptist we should not take this as meaning to put John the Baptist down since the Church acknowledges that he is among the greatest of all the saints. This is simply Jesus' way of helping us to realise to just what a high place God wants to raise us at the moment of our death.\n\nAn important thing to remember is that God works in history. This should be no surprise since it was God who created history and we should regard time itself as one of the greatest of God's creations. God, of course, exists completely outside time but since our human life is contained entirely within time it is impossible for us to comprehend his state of being.\n\nHaving created time God uses it to bring to fruition his plans for our salvation. He waits centuries before he intervenes in time in order to send his Son into the world. It takes a long period of development until humanity eventually reaches an understanding that there is only one God and is ready to accept that he is a God of love. Only when we have arrived at that point are we are ready to receive the Messiah.\n\nAnd once Jesus completed his work of salvation and returned to the Father we know that we will wait also for a very long time until God decides that everything is sufficiently ready so that he can bring creation to its final culmination on the Last Day.\n\nThis brings us back to Advent with its twin themes of waiting: waiting to celebrate the anniversary of the Birth of the Messiah and waiting for the Last Coming—the final Day of Judgement. But this waiting is not an idle thing because while we are waiting we are also preparing. We are preparing for a great religious feast but also preparing ourselves to face judgement on that final Day of Days.\n\nWe are half way through Advent already; we will soon be moving up a gear as we arrive at the period of the immediate preparation for Christmas. Let us not get so caught up in the festivities and all the Christmas fripperies that we neglect the real meaning of this beautiful season of Advent.\n\nLet us not focus so much on making New Year's Resolutions which tend to be rather secular, far better for us to make some Advent Resolutions. In this holy season let us make some decisions in the spiritual and moral areas of our lives, decisions that will really make a difference to our eternal welfare. A good way of doing this is to take advantage of the Penitential Service on Monday.",
   "father": "Welcome Father Cyril",
   "source": "Source: http://www.alexmcallister.co.uk/blog/third-sunday-of-advent2786177\nImage: Giovanni di Paolo - Saint John the Baptist in Prison Visited by Two Disciples",
   "reading1": "Is 35:1-6, 10",
   "reading2": "Jas 5:7-10",
   "reading3": "Mt 11:2-11",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1576364400000",
         "date": "15 December",
         "description": "There will be confessions in English after Mass."
      }
   ],
   "colors": {
      "color1": "#FFCAEA",
      "color2": "#000",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 11,
         "size": 9,
         "paragraphMargin": 2
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Our bulletin is now online. We hope you enjoy reading it!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2019-12-15-third-sunday-of-advent.html"
   },
   "saveAs": "2019-12-15-third-sunday-of-advent.markdown"
}