{
   "date": "March 1, 2020",
   "dateChanged": "2020-02-29 03:16:03 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Christ_in_the_Wilderness_-_Ivan_Kramskoy_-_Google_Cultural_Institute.jpg/684px-Christ_in_the_Wilderness_-_Ivan_Kramskoy_-_Google_Cultural_Institute.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "First Sunday of Lent",
   "text": "Here it is – March 1st – the First Sunday of Lent!  \n\nWe think about the usual practices of Lent: prayer, fasting, and almsgiving. St. Julie (*) was ahead of the times when she encouraged the Sisters who were heavily engaged in school and care of the children not to fast. She wrote to them: “There is another kind of fasting we are strictly bound and obliged to keep.  It is the fast of the heart, the senses, and the tongue.”  \n\nIn the gospel for this First Sunday, we hear that, having been led into the desert Jesus *“…fasted for forty days and forty nights, and afterwards he was hungry.”* (Matt 4:2). He was hungry, not for bread but for the Word of God.  He would not be tempted to perform a miracle for himself. The beatitude – *“Blessed are those who hunger and thirst for justice”* comes to mind. I wonder: for what do I/we hunger? From what do we need to fast?\n\nJesus was tempted to test the Word of God, to throw himself off the top of the temple and let the angels of God support him. *“You shall not put the Lord, your God, to the test.”* I wonder: for what do I/we ask from God while neglecting to do our part?\n\nFinally, he is shown all the kingdoms of the world which will be his if he only heeds Satan’s words: *“…prostrate yourself and worship me.”* What are my/our “kingdoms” – the places where we want to be in control, have the final word, determine the rules?\n\nI’m reminded of some simple words about fasting that seem to mirror Julie’s words. (source unknown)\n\n#####Lent is a time to Fast and to Feast\n\nFast from judging others. Feast on the Christ within them. --\nFast from emphasis on differences. Feast on the unity of all life. --\nFast from words that pollute. Feast on phrases that purify. --\nFast from discontent. Feast on gratitude. --\nFast from anger. Feast on patience. --\nFast from pessimism. Feast on optimism. --\nFast from worry. Feast on Divine Order. --\nFast from lethargy. Feast on enthusiasm.\n\nAnd from Julie we hear: “The holiest fast I ask is charity, the practice of charity towards one another.”\n\nLet’s pray for one another this Lent, that we may each recognize where we need to fast and to feast, and have the grace to persevere in that fasting and feasting, perhaps for the rest of our lives.\n\n(* *St. Julie Billiard, 1751-1816, founder of the Congregation of the Sisters of Notre Dame de Namur*)",
   "father": "Welcome Fr. Matthew",
   "source": "Source of reflection: Sister Edithann Kane SND, https://www.sndden.org/gospel-reflections/first-sunday-of-lent-3/\nSource of image: \"Christ in the Wilderness\" by Ivan Kramskoy (1837–1887), via WikiCommons: https://de.m.wikipedia.org/wiki/Datei:Christ_in_the_Wilderness_-_Ivan_Kramskoy_-_Google_Cultural_Institute.jpg",
   "reading1": "Gn 2:7-9; 3:1-7",
   "reading2": "Rom 5:12-19",
   "reading3": "Mt 4:1-11",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1583017200000",
         "date": "1 March",
         "description": "Our monthly **social gathering** comes off after mass. Please bring a dish to share if possible, or help with set-up or clean-up."
      },
      {
         "epoch": "1583622000000",
         "date": "8 March",
         "description": "Opportunity to receive the **Sacrament of Reconciliation** after mass. More additional opportunities for confession will follow during the season of Lent."
      }
   ],
   "colors": {
      "color1": "#4A194D",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, our bulletin for the first Sunday of Lent, March 1, is now available online.\nWe invite you to join us not only for worship, but as well for our get-together after mass. Bring a dish to share if you can!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2020-03-01-first-sunday-of-lent.html"
   },
   "saveAs": "2020-03-01-first-sunday-of-lent.markdown"
}