{
   "date": "July 12, 2020",
   "dateChanged": "2020-07-11 09:55:03 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Hortus_Deliciarum%2C_Das_Gleichnis_vom_S%C3%A4mann.JPG/1280px-Hortus_Deliciarum%2C_Das_Gleichnis_vom_S%C3%A4mann.JPG",
      "layout": "left",
      "size": 60
   },
   "title": "Fifteenth Sunday in Ordinary Time",
   "text": "The readings for this nearly mid-summer Sunday reflect the beauties of the earth: its golden harvests, its astonishing Spring, its delicate birds, beasts, mountains, hills and plains. Even in this time of virus, those whose eyes can see will find infinite surprise!\n\nYes, even in this time of virus and troubles.\n\n[...] In the First Reading the Lord uses this ebb and flow of seasons to show the workings of his visceral love for the earth.\n\nHe says,\n\n*Just as the rain and snow come down to earth,\nand do not return there till they have watered the earth,\nmaking it fertile and fruitful, …\nso shall my word be that goes forth from my mouth.\nIt comes to the world and does not return until it has moistened\nand nourished life in every single creature that will receive it.*\n\nA fruitful harvest, the Psalm calls it.\n\nThen, in the Second Reading, St. Paul speaks of all creation groaning in labor pains. Human beings too groan within themselves like seeds which break open and push their way through tough ground and evolve into full trees that stretch up for Christ’s light.\n\nCan such rich images apply to you and me? How is our own soil? God pours his grace into it always. Do you and I groan and yearn for the goodness of God which is already lavished upon us? Do we take time each day to let love in? Or when we listen to the Word on Sunday, perhaps with some interest, do we then forget everything by Monday?\n\nJesus lists a number of things we might have to correct in order to accept the gifts he has ready for us (Gospel). We might be shallow ground, he says. Or rocky soil. Weeds might choke us.\n\nDiscouraging, isn’t it? Must I pretend to be rich soil, though I know my shallowness?\n\nNo. I must be fully myself and allow God to do the rest. The Indian poet Tagore put it this way:\n\n*The cloud stood humbly in a corner of the sky.\nThe morning crowned it with splendor.* (Tagore, *Stray Birds*, #100)\n\nLet us be humble and join in the revolving refreshment of all earthly things. Can’t we open our leaves, and allow the sun to come in?",
   "father": "",
   "source": "Sources: Reflection by Fr. John Foley, SJ, https://liturgy.slu.edu/15OrdA071220/reflections_foley.html\nImage: Herrad of Landsberg, \"Hortus Deliciarum, Das Gleichnis vom Sämann\" (ca. 1180), photo by Dnalor_01, Wikimedia Commons (CC-BY-SA 3.0)",
   "reading1": "Is 55:10-11",
   "reading2": "Rom 8:18-23",
   "reading3": "Mt 13:1-23",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1594504800000",
         "date": "12 July",
         "description": "Invitation to join an **open-air Ecumenical Sunday Service at 11am**, on the lawn opposite our church St. Michael - for more detailed information, please visit https://stadtkirche-heidelberg.de/html/veranst/detailcb.html?&vt=1&m=160908&cb-id=12157066&tid=2499297"
      },
      {
         "epoch": "1594504800000",
         "date": "12 July",
         "description": "After finally clarifying several questions of vital importance for being able to getting back to public mass at ICCH, we now need to make sure all safety regulations are met and can be implemented in the weeks to come. In our community run by volunteers, this will be possible only with the help of our members. Beside the feedback we received from a few of our families, if any of you would consider helping with the practical implementation so we can get \"back to business\", kindly let us know via facebook or e-mail! Thank you!"
      }
   ],
   "colors": {
      "color1": "#40B5BF",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends,\nour bulletin for July 12 is now available at our website. Have a look not just at the reflection on the Parable of the Sower, but also on the NEWS section for information on an ecumenical open-air service this Sunday (11 a.m. opposite St. Michael), and on our need for help in order to finally resume public mass.\nHave a blessed Sunday!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2020-07-12-fifteenth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2020-07-12-fifteenth-sunday-in-ordinary-time.markdown"
}