{
   "date": "August 23, 2020",
   "dateChanged": "2020-08-22 10:38:37 +02:00",
   "image": {
      "enabled": true,
      "src": "https://t1.daumcdn.net/cfile/tistory/261C8D4F53E096773C",
      "layout": "left",
      "size": 52.5
   },
   "title": "Twenty-First Sunday in Ordinary Time",
   "text": "###Who do you say I am? \n\nIn the gospels, Jesus says many wonderful things. But the questions that he asks are far more challenging. In the gospel today, as Jesus is walking with his followers, he turns and asks them a direct and somewhat strange question; *‘Who do people say that the Son of Man is?’* They offer him a list of names that they have probably heard in the market place and on street corners. None of these seems satisfy him.\n\nJesus responds with a more personal and demanding question; *‘But you, who do you say that I am?’* There is a sense that with this second question Jesus is not interested in gossip, rumours or hearsay. He is asking and looking for a very personal and heartfelt response from his closest friends. He doesn’t want second hand or even fake news!\n\nPeter steps forward as the voice of the group and replies with courage, confidence and conviction, *‘You are the Christ, the Son of the living God’*. Peter is rewarded for his faithful response by being given a new name; Peter the Rock upon whom the church will be built. This is a great affirmation and start for Peter. But in next Sunday’s gospel, which continues directly for todays, things take a turn for the worst for him when Jesus challenges and even publically criticises him. More of that next week!\n\nAs always, we need to try to make sense of the gospels and scripture for ourselves today. Imagine standing with you Jesus right now. He looks at you, calls you by your name and asks, *‘Who do people [say] that the Son of Man is?’* Like those in the gospel, you might offer a list of names you have heard others use or read in books. Jesus looks directly at you and then asks, *‘But **you**, who do you say that I am?’* This is a very different and challenging question that requires some response on our part. You have heard the question, what is **your** response?\n\nAs we grow up and develop, hopefully there were people; parents, teachers, catechists and preachers who have introduced us to the person of Jesus. But there comes a time when we need to make a personal choice about Jesus for ourselves. There are so many books that will help us to discover who Jesus is; these are very helpful and important and they have their place.\n\nBut in the end, Jesus looks at you me and asks, *who do **you** say that I am? Who am I for **you?*** This question from Jesus is not meant to trip us up or catch us out; he simply wants to enter into a personal and intimate relationship with each of us. Jesus asks us the question and waits patiently and tenderly for our response.\n\nThis question of faith is still one that is asked of each of us today. Hopefully we meet and encounter Jesus though each other, in the Word of God and through the life of the sacraments. We are also being called and invited by Jesus to have a deep personal relationship with him on a daily basis. This does not mean that this is private; just between myself and Jesus; my friendship with Jesus is personal but never private. As a follower of Jesus, I am always connected to something bigger and richer than just myself; the Church – the Body of Christ. \n\nToday and over the coming days, take a little time to hear and listen to Jesus asking you personally, ***‘who do you say that I am?’***",
   "father": "Welcome Father Mathew",
   "source": "Source of reflection: Br Michael Moore OMI, Missionary Oblates of Mary Immaculate, https://oblates.ie/pray-with-us/weekly-reflections/",
   "reading1": "Is 22:19-23",
   "reading2": "Rom 11:33-36",
   "reading3": "Mt 16:13-20",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [],
   "colors": {
      "color1": "#52862D",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "\"Who do you say that I am?\"\nDear friends, whether at home or travelling, this is the question Jesus asks each one of us in this Sunday's Gospel. If you'd like, read the reflection shared in our newest bulletin on finding your very own answer to this question. Have a blessed Sunday!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2020-08-23-twenty-first-sunday-in-ordinary-time.html"
   },
   "saveAs": "2020-08-23-twenty-first-sunday-in-ordinary-time.markdown"
}