{
   "date": "September 13, 2020",
   "dateChanged": "2020-09-11 09:52:27 +02:00",
   "image": {
      "enabled": true,
      "src": "http://diglib.library.vanderbilt.edu/cdri/jpeg/Mafa064.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Twenty-Fourth Sunday in Ordinary Time",
   "text": "Today’s gospel selection is taken from a section of Matthew’s gospel that is concerned with the dynamics of a truly Christian community. It is fairly certain that Matthew’s gospel was written for the church at Antioch, where there were deep divisions between the more conservative Jewish Christians and the more liberal Gentile converts. Peter is featured in this gospel because he was the leader at Antioch who was able to hold these factions together by insisting on the importance of tolerance and reconciliation.\n\nIn such a difficult situation, forgiveness becomes a major issue. Jesus tells Peter that we must be ready to forgive others “seventy-seven times,” which really means, endlessly. And the parable that follows is intended to illustrate exactly how forgiveness must function in a loving community. It does not come simply from the goodness of one’s heart. It is possible only when one becomes aware of having oneself been forgiven. It is a splendid gift that has been first received and is then passed on to others. The unforgiving servant of the gospel story is condemned precisely because he refused to forgive a tiny debt after having been forgiven immeasurably.\n\nLife Implications\n\nThe Bible is very realistic about human nature. Every child is born yearning for approval and desperate for affirmation. Ir is a tragedy when that love and affirmation is not available. It is only affectionate touches and gentle words that enable an infant to reach out to the world in confidence and trust. Such loving affirmation continues to be needed all through life and the person who, through a misguided notion of self-sufficiency, claims to be beyond all that, is condemned to a twilight existence of feigned independence.\n\nAn important part of this loving affirmation is the readiness to forgive the mistakes and faults of others. Such readiness comes from an awareness of having been forgiven for one’s own faults. Moreover, this forgiveness is not limited to sinful behavior but extends to limitations of all kinds, which means, in effect, forgiveness for not being perfect! For these limitations of nature are also very burdensome and we need the help of compassionate and forgiving people to lift that weight from our shoulders.\n\nIt is important to understand what forgiveness does not mean. It does not imply that a fault or sin does not matter. Nor does it mean that the offense is forgotten, for that is often impossible. Rather, it means freely choosing to overlook an offense because one is free to do so, having been loved and forgiven oneself.\n\nThere can be no real Christian community without such an exchange of love. The seriousness of this challenge is expressed in the strong words of Jesus indicating that our present unwillingness to forgive will guarantee a harsh judgment at the end. If we are wise, therefore, we will take great pains to be lenient and compassionate toward others rather than self-righteous and hard-hearted, so that we may look forward to meeting a lenient and compassionate divine judge when our own lives are evaluated.",
   "father": "Welcome Father Matthew",
   "source": "Source: Demetrius R. Dumm, O.S.B., https://saintvincentarchabbey.org/2017/09/17/twenty-fourth-sunday-in-ordinary-time-classic/\nImage: JESUS MAFA. The Unforgiving Servant, from Art in the Christian Tradition, http://diglib.library.vanderbilt.edu/cdri/jpeg/Mafa064.jpg",
   "reading1": "Sir 27:30--28:9",
   "reading2": "Rom 14:7-9",
   "reading3": "Mt 18:21-35",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1599948000000",
         "date": "13 September",
         "description": "There will be confessions in English after Mass."
      }
   ],
   "colors": {
      "color1": "#3BBD00",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends in Christ, our bulletin is now online. We hope you enjoy reading it. There will be confessions in English this Sunday after Mass.\n\nThis week marks 7 years since we celebrated our first Mass (September 8th 2013). Contrary to previous years, we will not be able to have a bigger social gathering to celebrate this anniversary. Nevertheless, it is perhaps the perfect opportunity to reflect on the goodness of the Lord shown to us as a community these few years. On this note, we would also like to take the opportunity to extend our gratitude to all members, both far and near, who contributed in diverse ways by availing themselves and their services from the birth of this community right up until today. All these efforts have contributed to bringing us where we find ourselves now. As we all strive to make the best of the circumstances in which we find ourselves especially in the face of the current pandemic, let us remain united in prayer as a people of God, bound by cords of love that can never be broken.\n\nWe leave you with this beautiful song by the Community of Taizé and send you and your loved ones all God's blessings:\n\"Nothing can ever come between us and the love of God, the love of God revealed to us in Christ Jesus\"\nhttps://www.youtube.com/watch?v=S6N34yVj_qY\n",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2020-09-13-twenty-fourth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2020-09-13-twenty-fourth-sunday-in-ordinary-time.markdown"
}