{
   "date": "October 18, 2020",
   "dateChanged": "2020-10-17 04:50:59 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Rubens_tribute_money.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Twenty-ninth Sunday in Ordinary Time",
   "text": "###Which Side Are You On?\n\nThere seem to be two realms, God’s and Caesar’s. Jesus says so in Sunday’s Gospel: “Give to God the things that are God’s and to Caesar the things that are Caesar’s.”\n\nWhich realm do we live in?\n\nAre we “Sunday Catholics,” giving to God maybe an hour per week at Mass and then getting on with television and cars and work and food? And maybe with being afraid? Or with wishing things had turned out better? Do we leave it to professionals to pray to God while we live a lesser life? Have we given our life to Caesar?\n\nOr do we try it the other way around?\n\nPerhaps we are so serious about Christianity and spirituality that we try to get away from enjoyment of any worldly thing so as to live uncorrupted. Through the history of Christianity there have been marvelous examples of this. The desert hermits. The cloistered nuns and monks. The great mystics. “A penny for Caesar and all the rest for God”?\n\nIf you push this statement too far, however, everything of Caesar must go away because it is not God, or on the other hand, God has to go away because science and secularism are so powerful.\n\nMaybe Jesus made his statement to settle the argument that was posed to him by the Pharisees. Here is a key. Can God and Caesar co-exist? What if you are created to be a channel for God’s presence right in the midst of the secular world?\n\nWhat if, in spite of the voices within you that say you are not worth much, in spite of the setbacks of life, the losses, the flatness, in spite of all these, what if God created you with room inside you where God, out of love for you, can be quietly present?\n\nI can hear objections to such an idea: “God would never be at home in me, not until I do a lot better with my life.” Or, “You want me to be some kind of nut, running around acting holy?” Or, “Sure, I want to let God in, but I like beer and TV too much.” Or, “What does all this have to do with real life?” Or simply, “I don’t want to.”\n\nBut what if God were a great friend? In fact, how would it be if God were a companion who truly and actually accepts you and forgives you completely whenever you need it? Wouldn’t this give you another way to look at the connection between heaven and earth?\n\nWouldn’t it mean that God put you and me into the world to be holy in it, to be friends with the things of Caesar? To work in the world of sin in spite of our own sins?\n\nCould it be that we ourselves are those “things that belong to God” that Jesus spoke of? “Belong,” not in a possessive way, but in the way felt by people who love and are loved. We “belong.” If this were so, why wouldn’t we want to give ourselves to God, and then also to bring our God-filled selves to Caesar’s palaces and to the dirty roads outside them and show everyone what Jesus is all about?\n\nWhich realm should we live in?\n\nBoth.",
   "father": "Welcome Father Cyril",
   "source": "Reflection by Fr. John Foley, SJ, on https://liturgy.slu.edu/29OrdA101820/reflections_foley.html\nImage: \"Caesar's Coin\", by Peter Paul Rubens (1612-1614), via WikiCommons {{PD-US}}",
   "reading1": "Is 45:1, 4-6",
   "reading2": "1 Thess 1:1-5B",
   "reading3": "Mt 22:15-21",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1602972485563",
         "date": "18 October",
         "description": "According to the newest Corona instructions issued by our Archdiocese of Freiburg, **churches are not to be heated** this year beyond 10°C. Please dress accordingly and bring a blanket or shawl if necessary in order to avoid getting cold."
      },
      {
         "epoch": "1603576800000",
         "date": "25 October",
         "description": "As the \"critical stage\" of the pandemic (Pandemiestufe 3) has been declared for our federal state, from Oct 25 on we will be required to take the **contact data** (name, phone number) of every person attending Mass, via contact forms provided at the entrance. The completed forms remain with the parish coordinators and will be destroyed after the legally mandated retention period. "
      }
   ],
   "colors": {
      "color1": "#9D0000",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, which side are you on, God's or Cesar's? Find a reflection on this theme from this Sunday's gospel in our recent bulletin. You might also want to have a look at the NEWS section for updates on current regulations. And please remember to register - thank you and have a blessed Sunday!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2020-10-18-twenty-ninth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2020-10-18-twenty-ninth-sunday-in-ordinary-time.markdown"
}