{
   "date": "October 25, 2020",
   "dateChanged": "2020-10-24 05:53:45 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Brooklyn_Museum_-_The_Pharisees_and_the_Saduccees_Come_to_Tempt_Jesus_%28Les_pharisiens_et_les_saducéens_viennent_pour_tenter_Jésus%29_-_James_Tissot_-_overall.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Thirtieth Sunday in Ordinary Time",
   "text": "It is always difficult when people ask us to put a list of items in order of preference. For example, deciding whether we like chocolate more than mints, or apples more than oranges, could take hours. Often in arguments, our opponents might pose a range of options which is almost impossible to answer, such as: Which is greater, your love for your spouse or your love for your children?\n\nThis is what the Pharisees thought they were doing when one of them, a doctor of the law, asked Jesus: ‘Which is the greatest commandment of the Law?’ (Mt 22:36). We learn that, in asking this question, the Pharisee was trying to disconcert Jesus. So the Pharisees were hoping that, somehow, Jesus would make a mistake and say something that was incompatible with and offensive to the Jewish religion. Then they could use that against him.\n\nThey were jealous of his popularity with the crowds and they knew that they were dealing with a formidable teacher who could quote and explain the scriptures expertly. Surely now, they were thinking, Jesus would fall into the error of belittling at least some of God’s commandments by exalting one over another? We have probably all been in situations like this in discussions and debates, when we have been hard pressed to offer a satisfactory answer without compromising the faith or moral teaching in some way.\n\nJesus’ reply was simple and direct. First, he emphasised the first and greatest commandment to love God with our whole heart, soul and mind. Nobody could argue against that. The Pharisees must then have been waiting, hoping that a mistake was imminent.\n\nPope Francis reaching out like Jesus did.\n                    Pope Francis reaching out \nThen Jesus added that the second commandment is like the first: ‘You must love your neighbour as yourself’ (Mt 22:39). Next Jesus achieved a masterstroke. Instead of leaving it at that and, perhaps, allowing the criticism that the other commandments (forbidding theft, murder and adultery) are not so important, he added: ‘On these two commandments hang the whole Law and the Prophets too’ (Mt 22:40).\n\nThe cunning Pharisees must have been dejected. Not only did Jesus refute in advance any potential claim that he had diminished the importance of any of the commandments, but hc had included all the sayings of the prophets in his reply. The greatest of the commandments, which is to love God and neighbour, is the basis for every other law and every exhortation of the prophets who, over many centuries, had spoken about fidelity to God’s will.\n\nThe challenge for us is to reflect carefully on Jesus’ defence ol the truth. He did not shy away from the questions posed by the Pharisees, although he knew that they were being mischievous and trying to trap him. Let us resolve to answer honestly and thoughtfully the questions about our faith that are asked by family, friends and colleagues.",
   "father": "Welcome Father Matthew",
   "source": "Source: John Litteton, Journeying through the Year of Matthew, https://www.catholicireland.net/sunday-homily/#mdv\nImage: James Tissot, (1886-1894) - The Pharisees and the Sadducees Come to Tempt Jesus",
   "reading1": "Exod 22:20-26",
   "reading2": "1 Thess 1:5-10",
   "reading3": "Mt 22:34-40",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [],
   "colors": {
      "color1": "#3BBD00",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends in Christ,\nwe bring to you our bulletin for Mass this Sunday and would also like to remind you about the fact that clocks will be set back by an hour this night due to daylight saving time.\n\nAdditionally, we would like to remind you of the amendments made to the COVID-specific regulations for church gatherings which we mentioned in an earlier post this week. The most important of these being the need for data collection for those attending Mass, the wearing of masks at all times during Mass and the temperature of the church not exceeding 10°C . Kindly take note of this for the subsequent weeks.\n\nWe send you best regards for the weekend!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2020-10-25-thirtieth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2020-10-25-thirtieth-sunday-in-ordinary-time.markdown"
}