{
   "date": "December 20, 2020",
   "dateChanged": "2020-12-20 01:07:33 +02:00",
   "image": {
      "enabled": true,
      "src": "http://diglib.library.vanderbilt.edu/cdri/jpeg/Mafa045.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Fourth Sunday of Advent",
   "text": "The end of Advent has us in a state of eager expectation. Christmas is only a few days away. There is not much time left to prepare for the wonder about to take place. The Fourth week of Advent is not a week at all, just a few days, a few days for us to reflect one last time on the events leading to the celebration of the Nativity of the Lord. The Eternal Word of God is about to become one with us and one of us. \n\nToday’s Gospel takes us to that most familiar scene. There is Mary, usually depicted as praying with a book by her prie-dieu. The Angel appears, Gabriel, and Mary is rightly astonished. He does not call her Mary. He says, “Hail, Full of Grace.” We say, “Hail Mary, full of grace,” but the angel just says, “Hail Full of Grace.” Mary wonders, why would he call her that? What does this mean? The angel assures her that she is the favored one, she has found favor with God. She is to be a mother, the mother of Jesus, the Son of the Most High. Of course, any woman would wonder how this is going to happen. Even more, a virgin, perhaps 16 years old or younger, betrothed to a man whom mostly likely she had merely met, that being the extent of their relationship. The angel explains that the Holy Spirit will come upon her and the power of the Most High will overshadow her. He tells her about her kinswoman, Elizabeth, who has conceived in her old age.\n\nThen the angel waits. The world waits. All are waiting for Mary’s response. Will she allow salvation to begin within her? Will God’s special presence come upon earth? Will He become one of us? The world waits in eager expectation. And Mary humbly responds, “Behold.” That word Behold is used again. The angel began his explanation for his presence with that word, “Behold” ...you will conceive and so forth. Behold. He used that word a second time when he told Mary about Elizabeth, “Behold Elizabeth your kinswoman has conceived.” Behold. \n\nThe word Behold means Witness the power, and wonder at the glory of God. Behold. Now Mary uses that word. “Behold, I am the handmaiden of the Lord, be it done unto me according to your word.” Mary’s Behold follows the meaning of the angel’s Behold. She says, “Behold the power, the wonder and the Glory of God will take place within me.”\n\nAnd the Word Becomes Flesh. It is at the Annunciation, at Mary’s “Behold,” when the Holy Spirit comes upon her and the Power of the Most High overshadows her. It is then that a baby is formed within her. This is not just a zygote that eventually become an embryo which soon becomes a fetus. This is a baby. In fact, every pregnancy begins with a baby. Mary’s baby is different though. Her baby is the Word Become Flesh. God became One of us within Mary at the Annunciation. Later in the great story of salvation, under the cross, Mary would become a mother again, our mother.\n\nThe world waited for her answer. Finally she said, “Behold.”\n\n“Hail, full of Grace,” Gabriel’s greeting could be directed to each of us after our baptism. At our baptism, we received the Life of God. At our baptism, we received the grace of God. Did we receive the Grace of God to the extent that Mary receive Grace? No, we were not conceived totally united to God as Mary was at her conception. We were not immaculately conceived. It was after our conception and after our birth, and for some after a number of years that we were brought to the Church and received God’s grace.\n\nWe were given the Grace of God. In a way we also were overshadowed by the Holy Spirit so that we, like Mary, can fulfill the mission the Lord has for each of us. This mission is certainly not as momentous as Mary’s, infinitely less, but it is still a mission from God. Our mission is to proclaim to the world that the spiritual has become physical, that God is One of Us and One With Us, that the evil one has been conquered, and the ransom price for human beings has been paid with the Body and Blood of the Christ. We are called to tell the world that those who believe that Jesus is the Christ will have life in his name.\n\nThe world waits. It waits for our answer. Will we accept the mission God has for each of us? Will we spread the Kingdom of Justice, the Kingdom of Peace, the Kingdom of Love? Will we have the humility and the courage to join Mary and say, “Behold.”",
   "father": "Welcome Father Matthew",
   "source": "Source: Msgr. Joseph A. Pellegrino, http://frjoeshomilies.net/12-20-21.html\nImage: The Annunciation - Gabriel and Mary, JESUS MAFA",
   "reading1": "2 Sam 7:1-5, 8-12, 14, 16",
   "reading2": "Rom 16:25-27",
   "reading3": "Lk 1:26-38",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1608423778345",
         "date": "20 December",
         "description": "There will be confessions in English after Mass."
      },
      {
         "epoch": "1608850800000",
         "date": "25 December",
         "description": "Mass at ICCH on Christmas Day comes off at 12.00 noon. We look forward to seeing you there."
      }
   ],
   "colors": {
      "color1": "#9B00BD",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 10,
         "size": 10.5,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, we bring you our bulletin for this week's Sunday Mass. Be reminded to register for Mass via the link provided. There is also going to be the opportunity to receive the Sacrament of Penance and Reconciliation after Mass.\n\nAlso, we would like to inform you that there will be Mass in English on Christmas Day, December 25th at 12 noon. After that, we take a break until January 10th 2021 (usual time 13.00). ",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2020-12-20-fourth-sunday-of-advent.html"
   },
   "saveAs": "2020-12-20-fourth-sunday-of-advent.markdown"
}