{
   "date": "June 27, 2021",
   "dateChanged": "2021-06-26 09:03:55 +02:00",
   "image": {
      "enabled": true,
      "src": "https://diglib.library.vanderbilt.edu/cdri/jpeg/Daughter%20of%20Jairus%20MAFA.jpg",
      "layout": "left",
      "size": 57.5
   },
   "title": "Thirteenth Sunday in Ordinary Time",
   "text": "###Touching Jesus\n\nShe said, “If I but touch his clothes, I shall be cured.”  Mark 5:28\n\nHere is an example of one who comes to Jesus with great faith.  It’s a fascinating story, in that we are given the gift of being able to know her thoughts.  \n\nThis woman had suffered greatly for many years.  She tried everything she could to be cured by doctors.  She spent all she had.  And then, in this desperate state, the woman turned in faith to Jesus.\n\nPerhaps she had had great faith throughout her life; we do not know.  What we do know is that in her suffering, she was greatly humbled and was out of options.  In this humble condition, she did what any saint would do.  She held on to the conviction that Jesus was the answer.  When all else failed, Jesus would not let her down.  Perhaps she didn’t know if she would be physically healed, but she did know she had to turn to Jesus nonetheless.  \n\nThere is a great lesson in this story, in that we must have the same depth of trust and the same commitment to turn to Jesus with our life.  Even if we have not tried every other option in life, we must all embrace the witness this woman gives.\n\nTurning to Jesus with deep certainty and faith means we know that His will is all that matters.  It means that we choose Him above all else and in every circumstance of life.  It means we do not only turn to Him with our problems, we also turn to Him with our joys and in our blessings.  Everything we do must come from a deep interior conviction that Jesus is the answer to everything in life.\n\nPerhaps that sounds like a bit much.  Perhaps we have a habit of turning to Him only when everything else seems to fail us.  But it shouldn’t be so.  We are called to build a daily habit of seeking to “touch His clothes,” so to speak.  This is a way of saying we must turn our heart, mind, will and soul to Him always.\n\nReflect, today, on how deep your habit is of reaching out to Jesus.  Is He the first one you praise in your blessings?  And is He the first one you turn to in your fears and struggles?  Build this interior habit and you will see miracles of grace in your life.\n\n*Lord, help me to always turn to You in all things.  Help me to trust You when life seems hard and when things seem to fall apart.  Help me to also turn to You in all the many blessings I receive.  Jesus, I trust in You.*",
   "father": "Welcome Father Mathew",
   "source": "Source of reflection: © 2020 My Catholic Life! Inc. All rights reserved. Used with permission. www.mycatholic.life\nSource of image: JESUS MAFA. Healing of the Daughter of Jairus, from Art in the Christian Tradition, a project of the Vanderbilt Divinity Library, Nashville, TN. https://diglib.library.vanderbilt.edu/act-imagelink.pl?RC=56455 [retrieved June 26, 2021]. Original source: http://www.librairie-emmanuel.fr",
   "reading1": "Wis 1:13-15; 2:23-24",
   "reading2": "2 Cor 8:7, 9, 13-15",
   "reading3": "Mk 5:21-43",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [],
   "colors": {
      "color1": "#BF7A40",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 14,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends,\nour bulletin for this Sunday, June 27, is now online. We hope you enjoy reading the reflection about the healing touch of Jesus in our lives. Have a blessed Sunday!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2021-06-27-thirteenth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2021-06-27-thirteenth-sunday-in-ordinary-time.markdown"
}