{
   "date": "September 12, 2021",
   "dateChanged": "2021-09-11 08:55:20 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Anton_Van_Dyck_-_Christ_carrying_the_Cross_-_Google_Art_Project.jpg/377px-Anton_Van_Dyck_-_Christ_carrying_the_Cross_-_Google_Art_Project.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Twenty-Fourth Sunday in Ordinary Time",
   "text": "Today’s Sunday scripture readings open with a passage from the prophet Isaiah, in which the prophet speaks of his fidelity to the Lord even in very difficult times, and of the way in which the Lord provided refuge for him in this time of testing. We read, “I gave my back to those who beat me, my cheeks to those who plucked my beard; my face I did not shield from buffets and spitting. The Lord God is my help, therefore I am not disgraced” (Isa 50:6-7).\n\nThis part of Isaiah’s prophecy is one of the four so-called “servant songs” contained in chapters 42 through 53 of this lengthy book. The servant songs can be read in a number of ways, but in Christian interpretation they have often been considered anticipations of the suffering of God’s messiah—Jesus Christ. Isaiah reminds us that the redemption which the “suffering servant” brought about would be established precisely through the suffering he freely accepted on behalf of his people.\n\nChrist gave himself over for us in an act of love that every parent recognizes when they look at their children, every wife or husband understands when they think fondly of their spouse, and every true friend imitates when he or she makes a sacrifice for their alter ego. Christ’s act of self-giving goes beyond our human inklings and attempts however, and reaches its perfection in his free acceptance even of death for the sake of our salvation.\n\nThe same point is at work behind the scenes in today’s reading from the Epistle of James. This great leader of the early Church writes “What good is it, my brothers and sisters, if someone says he has faith but does not have works?” (James 2:14). James is telling us that if we truly believe in Jesus then our faith in him will naturally be followed by acts of self-giving love in imitation of him: these are the “works” of which James speaks. The self-giving witnessed in these works of Christian charity does not effect our salvation, but rather is an authentic sign of our faith in Christ and the redemption he accomplished through his perfect self-giving.\n\nTo bring this self-giving in imitation of Christ to its perfection means to be willing to suffer, and to do so, if necessary, on behalf of others. To be most like Jesus, to be his most faithful disciple, thus means to share in his resurrection and new life through a sharing in his cross. Our contemporary society firmly rejects this as the naiveté of religious belief, but then again the society of our Lord’s own day did the same, as Saint Paul witnesses: “The message of the cross is foolishness to those who are perishing, but to us who are being saved it is the power of God…. we proclaim Christ crucified, a stumbling block to Jews and foolishness to Gentiles, but to those who are called, Jews and Greeks alike, Christ the power of God and the wisdom of God” (1 Cor 1:18, 23-24).\n\nIn today’s gospel Jesus asks his followers “Who do people say that I am?” and then gives the first prediction of his passion and death, the ultimate example of self-giving love. Let it be our prayer that we may always “say” that he is the Lord and messiah who redeems us through his freely accepted suffering on our behalf, and may always find strength in his words: “Whoever wishes to come after me must deny himself, take up his cross, and follow me. For whoever wishes to save his life will lose it, but whoever loses his life for my sake and that of the gospel will save it” (Mark 8:34-35).",
   "father": "Welcome Father Mathew",
   "source": "Source: Father Edward Mazich, O.S.B., https://saintvincentarchabbey.org/sunday_homilies/24th-sunday-in-ordinary-time/\nImage: Anthony van Dyck - Christ carrying the Cross, https://en.wikipedia.org/wiki/File:Anton_Van_Dyck_-_Christ_carrying_the_Cross_-_Google_Art_Project.jpg",
   "reading1": "Is 50:5-9",
   "reading2": "Jas 2:14-18",
   "reading3": "Mk 8:27-35",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1631397600000",
         "date": "12 September",
         "description": "To commemorate the founding of our community (8th Sept. 2013), we will have a parish picnic at the forecourt of the church. We encourage you to bring \"finger food\" that can easily be shared e.g. baked goods, fruits, cookies and the like. Also kindly bring along a picnic mat that you can sit on in the open space. We look forward to seeing you there!"
      },
      {
         "epoch": "1632002400000",
         "date": "19 September",
         "description": "Confessions this month will take place on 18th September. Kindly take note of this change."
      }
   ],
   "colors": {
      "color1": "#3BBD00",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 11,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Some 8 years ago, a few of us were gathered together for the first time as a community in the St. Michael Church to celebrate the first Holy Mass. This seed gradually grew to become what we have today, the International Catholic Community Heidelberg. We are grateful to all members, both past and present, who contributed in diverse ways to ensure that this community continued to grow from strength to strength. We also ask for more grace and for the good Lord to bind us all with cords that cannot be broken!\n\nIn the spirit of love and unity, we would like to come together in a pandemic-conform way to share a few words with each other over some finger food (cookies, fruits, etc.). This will take place in the form of an open-air picnic tomorrow after Mass right in front of the church. With the weather looking dry, we hope to be able to sit out on the grass with some finger-food and coffee. Please bring anything along which is easy to hold in the hand and can be shared, as well as a picnic mat or blanket that you can spread out to sit on. As always, volunteers to help with the setting up and cleaning up thereafter will be greatly appreciated. For this reason, confessions will take place next week,19th September after Mass.\n\nWe look forward to seeing you soon!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2021-09-12-twenty-fourth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2021-09-12-twenty-fourth-sunday-in-ordinary-time.markdown"
}