{
   "date": "November 7, 2021",
   "dateChanged": "2021-11-06 11:40:26 +02:00",
   "image": {
      "enabled": true,
      "src": "https://4.bp.blogspot.com/-WhUIYAgvDOs/Vo7SwJ3E_6I/AAAAAAAABuU/cPPngCJ0ABQ/s720-Ic42/Mafa060-widows-mite.jpg",
      "layout": "left",
      "size": 57.5
   },
   "title": "Thirty-second Sunday in Ordinary Time",
   "text": "###“The poor widow has put in more than all.”\n*Mark 12:38-44*\n\n[...] Today’s Gospel calls us, not to worry or fear walking with Jesus or meeting him in our Church this Sunday, but simply to ponder our actions and our motivations. We need not make judgements, or be overly critical, or hard on ourselves. Jesus will not expect us to have simple answers to today’s issues. No! sitting with Jesus we can ask him, “What must I do to inherit eternal life?” and his answer might just be a lot simpler than we think. Try it!\n\nAnd it is the idea of ‘sitting with Jesus’ which leads me to the second small but wonderful story in today’s Gospel.\n\nWhen I read the Gospels I often look for, what I call, the ‘tiny clues’ which tell us something about the person of Jesus. In the small story of the widow’s offering we get, I think, one such ‘clue’.\n\nIt is at the very start of the story: “Jesus sat down opposite the place where the offerings were put and watched the crowd putting their money into the temple treasury.”\n\nHere we see Jesus, not doing anything, just sitting, hopefully resting, relaxing and idly watching the people come and go into the Temple. It is a restful scene.\n\nAs he was watching, not really looking for anything, he noticed the poor widow come up to make her offering. What he saw touched him in some way, it affected him and his heart goes out to her. In fact, it affected him so much that he calls his disciples to point out to them what this wonderful woman has done.\n\nFor me it is a beautiful, restful picture of Jesus – sitting, watching, observing what is happening around him. And it is not the wealthy and well-dressed he notices, but a poor widow, insignificant in the eyes of the world. Her few copper coins, valueless to the magnificence of the temple are what is most important to him. Of all those present she stands out to him and he makes her greatness known to the others who would never have noticed her.\n\nYou see, Jesus watches, and he notices all of the tiny, insignificant, unconscious even, good things we do. A kind word, a smile, an acknowledgement, a ‘thank you’, stopping for a moment to listen to someone, a hug, a kiss, ‘I miss you’, ‘can I help?’, ‘don’t worry’, and so, so many other tiny copper words and actions we don’t notice or forget. They may be unnoticed by others, forgotten by us, but never lost to God.\n\nWe are good at spotting our sins. We are not so good at spotting the good we do. But Jesus does spot our tiny acts of kindness and he does not forget them. They stand out for him. They touch him.\n\nHow could we ever fear the God revealed to us in this Gospel? [...]",
   "father": "Welcome Father Mathew",
   "source": "Source of reflection (shortened): Fr. Brian Maher OMI, https://oblates.ie/pray-with-us/weekly-reflections/\nSource of image: JESUS MAFA. The Widow's Mite, from Art in the Christian Tradition, a project of the Vanderbilt Divinity Library, Nashville, TN. https://diglib.library.vanderbilt.edu/act-imagelink.pl?RC=48392 [retrieved November 6, 2021].",
   "reading1": "1 Kgs 17:10-16",
   "reading2": "Heb 9:24-28",
   "reading3": "Mk 12:38-44",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1636239600000",
         "date": "7 November",
         "description": "**Church Coffee** after Mass (in front of the church, i.e.!)"
      },
      {
         "epoch": "1636844400000",
         "date": "14 November",
         "description": "Father Cyril's last Sunday at ICCH"
      },
      {
         "epoch": "1637449200000",
         "date": "21 November",
         "description": "Monthly opportunity for **confessions** (*Fr. Mathew*) after Mass."
      },
      {
         "epoch": "1638054000000",
         "date": "28 November",
         "description": "Father Mathew's last Sunday at ICCH and handing over to our new priest, Fr. Martin Müller."
      }
   ],
   "colors": {
      "color1": "#4D3719",
      "color2": "#E5DFB3",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, for November 7, our weekly bulletin is now available online.\nIn it, besides a reflection on \"The Widow's Mite\", you will find important information on the upcoming change of priests at ICCH.\nAlso, invitation to join us for a moment tomorrow after Mass for coffee and cookies (bring if you can)!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2021-11-07-thirty-second-sunday-in-ordinary-time.html"
   },
   "saveAs": "2021-11-07-thirty-second-sunday-in-ordinary-time.markdown"
}