{
   "date": "December 19, 2021",
   "dateChanged": "2021-12-18 11:39:50 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Visitaci%C3%B3n_de_Rafael.jpg/433px-Visitaci%C3%B3n_de_Rafael.jpg",
      "layout": "left",
      "size": 42.5
   },
   "title": "Fourth Sunday of Advent",
   "text": "(...) After spending two Sundays of Advent in the company of John the Baptist, we are now on the brink of Christmas and our focus, rightly, moves to Mary, chosen to be and humbly accepting the honour, the task, the worry, the loneliness of becoming the Mother of God. “Becoming the Mother of God.” – Even writing this awes me!\n\nThe Annunciation has happened already. The wonderful “Yes” of Mary has been said and she is, through the Holy Spirit, with child. It is so easy to skip over the implications of Mary’s “Yes”, to presume that once it was said everything slots nicely into place and nine months later, Jesus is born.\n\nBut life is not like that, and we would, I think, be doing Mary a terrible disservice if we neglected to ponder with her those months of waiting, and wondering, about the child she was to bring into the world. Once again, the Gospels give us only glimpses into these months, but they are enough to share something of what she must have gone through with her.\n\nWe know that, at first, Joseph was going to leave her. In Matthew we hear: “Because Joseph her husband was a righteous man and was unwilling to disgrace her publicly, he resolved to divorce her quietly.” (1:19)\n\nImagine the pain and betrayal Joseph must have felt at that time. His betrothed, the woman he loved and was to marry, pregnant and not by him!\n\nBut more importantly, think of the acute and deep pain Mary must have suffered. How could she properly explain to Joseph what had happened to her when she really did not understand it herself. In silence she must have worried, wept, and waited for Joseph to abandon her. We do not know how long it was before Joseph, too, was assured by God that it was all right to take Mary as his wife; that the child she was to bring into the world was of the Holy Spirit.\n\n \n\nA few days? A week? A month? Longer? It doesn’t really matter. It is enough to know that leaving her was considered and planned for.\n\nIs it too much to wonder if the first sentence of today’s Gospel might be read with this as the background?\n\n“Mary set out and went as quickly as she could to a town in the hill country of Judah.”\n\nIt would not have been an easy journey – three or four days walking in hilly, exhausting terrain.\n\nIsn’t it possible, and even wonderful, to imagine Mary seeking out her cousin Elizabeth, an older woman and also pregnant, for support, comfort and maybe even a practical woman’s advice?\n\nJourneys are always important in the Bible. They are times when God encounters his people, and they are also times when God’s people reflect and grow (often painfully) to know God better. At the end of their journey, they usually emerge a stronger, more united people, able to move forward in their relationship with God.\n\nSurely this journey of Mary to Elizabeth is such a journey.\n\nAs soon as they greet one another their unborn children, Jesus and John the Baptist, recognise one another and we are told both children “leaped for joy” in their mothers’ wombs. Imagine the loneliness Mary must have felt setting out, her anxiety and fear as she walked the pathways and then….then….All of that swept away as soon as the two women meet.\n\nNot only does she experience joy, but Elizabeth’s words must have been a comforting balm for her soul:\n\n“She gave a loud cry and said, “Of all women you are the most blessed, and blessed is the fruit of your womb.”\n\nElizabeth was the person God chose to offer Mary the support she so desperately needed at that time. When we are in pain, alone or feel betrayed God will, if we but listen, speak words of support and comfort to us through others. We must also open ourselves to the pain of others so that we may be used by God just as Elizabeth was.\n\n“Why should I be honoured with a visit from the mother of my Lord.”\n\nHow Mary must have welcomed those words. It must have sounded like the angel returning to say to her again:\n\n“The Lord is with you. Do not be afraid, Mary; you have found favour with God. You will conceive and give birth to a son ….”  (Matthew 1:29-30)\n\nIt is no wonder that a short while later Mary was able to begin her Magnificat with the words:\n\n“My soul glorifies the Lord, / My spirit rejoices in God my saviour…”\n\nToday’s Gospel is one of joy, support, and comfort. Two women chosen by God to bring into the world incredibly special children. Today they meet and spend time together, time blessed by God with joy and, I feel sure, much sharing about the great things God had done for them. (...)",
   "father": "Welcome Father Martin",
   "source": "Source of reflection (shortened): Brian, Missionary Oblates of Mary Immaculate, https://oblates.ie/pray-with-us/weekly-reflections/\nSource of image: Raphael, \"Visitacion\" (ca. 1517)",
   "reading1": "Mi 5:1-4a",
   "reading2": "Heb 10:5-10",
   "reading3": "Lk 1:39-45",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1639872648975",
         "date": "19 December",
         "description": "Opportunity to receive the Sacrament of Reconciliation after Mass, at the parish office."
      },
      {
         "epoch": "1640386800000",
         "date": "25 December",
         "description": "Mass on Christmas Day starts at 11:30 am.  "
      }
   ],
   "colors": {
      "color1": "#24194D",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2021-12-19-fourth-sunday-of-advent.html"
   },
   "saveAs": "2021-12-19-fourth-sunday-of-advent.markdown"
}