{
   "date": "March 20, 2022",
   "dateChanged": "2022-03-19 05:53:50 +02:00",
   "image": {
      "enabled": true,
      "src": "https://revcrystalk.files.wordpress.com/2009/04/miraclesofthelordpa31.jpg",
      "layout": "left",
      "size": 27.5
   },
   "title": "Third Sunday of Lent",
   "text": "Th[e] conversion to being set on fire by God's concern for his people is also at the heart of the Gospel. \n\nTo prepare the ground for understanding the parable of the barren fig tree, Luke reports how Jesus reacts to the news of a particularly cruel bloodbath by the Roman governor in the temple of Jerusalem and thus to the unspoken question of who was to blame for this misfortune or how God could allow it to happen.\nJesus answers - as so often - with a counter-question. He refers to another misfortune.\n\nIn this way, he exposes the questioners as those who have made a rigid scheme out of the connection between guilt and misfortune. In any case, they do not need to think about their own repentance.\nSuffering is not simply a punishment from God.\nBut every misfortune should be a cause for repentance for all.\nGod can turn a misfortune into a positive force in retrospect. He can turn it into an occasion for the people to reflect and repent.\nBut if instead we only look for scapegoats, then we ourselves are not affected, we are \"off the hook\", as it were, but have learned nothing, the misfortune was in vain.\n\nJesus thus relates the events as \"signs of the times\" to the whole people of God, who are always called anew to repentance.\nHe locates the events in the end-time situation where it is a matter of life or death.\nHe relies on the patience of the Lord of history, who then appears in the parable as the “person who had a fig tree planted”, the Lord of the vineyard of Israel.\nHe gives a deadline. To whom? To us. Today to listen anew to his address, his word.\n\nAfter teaching the people who brought him the latest news, Jesus now tells the parable of the fig tree that bears no fruit.\nFor Jesus it is clear: A fig tree that is useless and only drains the soil in the vineyard must be cut down.\nJesus is said to have cursed and withered a barren fig tree in a parable-like act during the days before his death.\n\nWhen we reflect on what this parable teaches us, we are struck:\nIt shows us what we are here for.\nNot so that we bloom beautifully and the sap goes strongly into the leaves, but so that we bear fruit.\nThe Christian is not there for himself.\n\nJesus' parable, however, only comes to its climax afterwards.\nThe gardener intercedes on behalf of the fig tree: \"I shall cultivate the ground around it and fertilize it; it may bear fruit.”\nThis \"it may\" with which the gardener asks for a reprieve from the Lord of the vineyard is not a vague assumption.\nIt is covered by his personal commitment, which he promises.\n\nSo the Gospel tells us:\nEach of us is the guardian of his brother, his sister, is jointly responsible and partly to blame if the faith of the other remains without fruit.\nI am in demand. I have to be an intercessor and helper for my neighbour and the community - like Moses, like Jesus.\nGod listens to such intercessions. And he even helps us when we start practicing help. For the Israelites, his name is “I-am-who am”: I am your liberator. For you and me he is “I am who am”: your motivator, your confirmator, comforter, wakener.\n\nSo also our chance, when we are weak, lies with the others.\nThey stand up for us.\nGod listens to this \"it may\", he grants us this deadline.\n\nWe get it: the texts of Lent want to shake us, also the memory of Jesus' suffering, that we ask ourselves the question:\nWho is willing to help ensure that the fig tree is full of fruit and that our devotion also contributes to a new Easter for the Church?",
   "father": "Welcome Father Martin",
   "source": "Source of reflection (shortened): Father Martin Müller SJ, 2022.\nSource of image: \"Cursing the fig tree\", Byzantine icon. https://commons.wikimedia.org/wiki/File:Miracleofthefig.jpg",
   "reading1": "Ex 3:1-8a, 13-15",
   "reading2": "1 Cor 10:1-6, 10-12",
   "reading3": "Lk 13:1-9",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1648335600000",
         "date": "27 March",
         "description": "Opportunity to receive the **Sacrament of Reconciliation**, after Mass.\nFurther opportunities for confessions before Easter will be on April 3 and April 10 (Palm Sunday)."
      }
   ],
   "colors": {
      "color1": "#3F194D",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, our most recent bulletin for the Third Sunday of Lent is now available on our website.\nHave a look at the reflection by our own Father Martin, and the news section for information on Lenten confession times.",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2022-03-20-third-sunday-of-lent.html"
   },
   "saveAs": "2022-03-20-third-sunday-of-lent.markdown"
}