{
   "date": "May 1, 2022",
   "dateChanged": "2022-04-30 04:05:50 +02:00",
   "image": {
      "enabled": true,
      "src": "https://1.bp.blogspot.com/-YX_OOSeGdF4/Vv-rpNRlDLI/AAAAAAAACDk/aXQUtYw2xCk/s640/The_miracle_of_the_Catch_of_153_fish.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Third Sunday of Easter ",
   "text": "[...] There are many stories about the search for the treasure of life. And they all say: Whoever wants to win this treasure must set out, engage in the\nunknown, in adventure. And at the same time, he must never be deceived into thinking that something he has found is already this treasure. Even after a great find, a precious find, he has to go on - and one day he will find himself back where the treasure hunt started from. He will do what he always did. But he himself, this person, has become someone else. He has come to know the whole forest with its secret and its treasures, and now carries it within himself, as it were. And that is why he can be at peace with himself and with life.\n\nToday's Gospel tells of Easter in a strikingly similar way. Is it perhaps also about the treasure of life? Let us watch! Peter, Thomas and the other disciples of Jesus\nhave apparently returned from Jerusalem to their home, to Lake Genesaret, where they were fishermen. [...] they were back where they had started, only infinitely poorer\nthan they had ever been before. On Good Friday, they had lost the hope without which one cannot really live: the hope that evil will not have the last word, that\njustice will not be in vain and that God will not remain an empty word.\n\nI'm going fishing, Peter says, and one can still hear in this the abyss of resignation into which the disciples had fallen. No wonder that their work that night was also\nunsuccessful. How can I succeed if I approach it with the conviction: There's no point anyway!\n\nBut, wait, how was it at the lake back then? To a stranger who asks them for something to eat in the morning, they cannot offer anything because they had\nbeen so unsuccessful. But for his sake, because he asks them to, they cast the net again, even though it must be in vain at the beginning of the day - only at night\ncan the fish be deceived. They do it for him, the stranger's sake - at least he should see their good will. And when they haul in the net again, they don't make it,\nthere are so many fish in it. Spontaneously they suspect: If there are such moments in the middle of our hopeless situation, in the middle of our banal working day, are they not indications that, contrary to outward appearances, not everything ends in futility, that Jesus was not disproved and therefore did not perish in death? Is it perhaps none other than he himself who reveals himself in such unforeseen moments as the living and the near one? The favourite disciple, crazy as only love is, therefore freely asserts: It is the Lord! The others simply believe it - and meet this insight halfway, as it were. But at the same time they were biased, so that they did not dare to ask more closely: Who are you? It seems that he is, but can that really be? Questions that are still questions of Christians today, including our own.\n\nAnd then another strange thing. When they come to the shore, there is already a charcoal fire burning with fish and bread on it. He, who had asked them for\nsomething to eat before, has obviously prepared something for them. So it seems that what they have caught is not so important. The experience of doing one's part\nin faithfulness and goodwill against all disappointment, and then to experience that this is not pointless, was that the really important thing? That's how it is: He took\nthe bread and gave it to them, as well as the fish. They know this from Maundy Thursday. And they know what it means: he gives them everything he has to give,\nhimself - now as the paschal one, the one whose life is indestructible.\n\nAnd if something similar were also true in the situation today? If it were not primarily a matter of what we have brought together, but that we do our part with\ngood will and in faithfulness and patience, because the essential has long since been prepared and is making its breakthrough, no matter how many obstacles are\nput in its way? I hope so. I hope it so much. Without this hope, I would have to give up.\n\nEaster as a story of the treasure of life found: the disciples are where they have always been. But everything, including themselves, has become different:\nOutwardly, they are doing the same thing they always did. From the inside, it is a new life: In the midst of the inconspicuousness of their working day, they know\nthemselves to be gifted: gifted by God through Jesus with the certainty that he has more than enough for them. And that therefore the most important thing - that\neverything has its meaning and reason - will not be lacking. This reconciles us with life as it is. And makes it possible for someone to bear and endure its\nlimitations, its wounds. Like Peter, for example: Three times he had denied Jesus. Three times he is now asked by the Risen Lord at the lake whether he loves him.\nPeter knows exactly why three times. He is sad about himself. But that is exactly why he is allowed to hear: Feed my sheep! And: Follow me! In spite of his\nweakness, he is capable of becoming a paschal man and God has great plans for him. It is clear that John did not speak of this out of a desire to gossip about his\ncolleague, but in our direction.",
   "father": "Welcome Father Martin",
   "source": "Source of reflection (shortened): Father Martin Müller SJ (2022)\nSource of image: The miracle of the Catch of 153 fish by Duccio (14th ct.), https://commons.wikimedia.org/wiki/File:The_miracle_of_the_Catch_of_153_fish.jpg",
   "reading1": "Acts 5:27-32, 40b-41",
   "reading2": "Rev 5:11-14",
   "reading3": "Jn 21:1-19",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1651960800000",
         "date": "8 May",
         "description": "Next scheduled opportunity to receive the **Sacrament of Reconciliation** after Mass."
      }
   ],
   "colors": {
      "color1": "#D2A679",
      "color2": "#333",
      "border": "#333"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, \nfind the bulletin for this Sunday, May 1st, on our website. We hope to see many of you at mass!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2022-05-01-third-sunday-of-easter.html"
   },
   "saveAs": "2022-05-01-third-sunday-of-easter.markdown"
}