{
   "date": "June 26, 2022",
   "dateChanged": "2022-06-25 10:22:13 +02:00",
   "image": {
      "enabled": true,
      "src": "http://www.archivioradiovaticana.va/en/storico/2016/06/files/photo/2016/06/22/RV16889_Articolo.jpg",
      "layout": "left",
      "size": 47.5
   },
   "title": "Thirteenth Sunday in Ordinary Time ",
   "text": "### Toward Jerusalem\n\nJesus is fierce in Sunday’s Gospel. He is on the march and will not be turned back. Sometimes the readings startle us.\n\nHe “rebukes” the disciples.\n\nHe shouts “let the dead bury the dead” to a man who wants to bury his father and then follow Jesus. \n\nJesus is moving fast, and his mood is intense. Get ready for it. But what is the reason for this intensity?\n\nDo you remember back when Jesus began his public ministry before Lent and Easter? He came from the desert filled with the Holy Spirit and headed straight to Nazareth, his home town. He wanted to preach his mission. His own townspeople rejected him. They were more than blunt about it: they tried to throw him off a cliff (Luke 4:14ff).\n\n[...] Now a new section of Luke begins. It is called the “Journey to Jerusalem” (Luke 9:51-19:28).\n\nThis new phase begins with the rejection of Jesus!\n\nHe leaves his home town. The people in Samaritan towns turn him away. He had sent messengers ahead to “warm up the audience,” so to speak, but the villagers would not let him enter. Of course, Jews and Samaritans were hostile to each other, and surely that is part of the reason for the rejection of him. But Luke says the real reason is that they knew he was “going up to Jerusalem.”\n\nThink about that phrase, “going up to Jerusalem.” The “going up” part is literal, since Jerusalem is built upon a hill or rise and you have to climb to get up to it. But Luke wanted the metaphorical sense too. Jesus had set his face to “go up” to the height of the cross.\n\nThe Greek word Luke uses for “go up” is the same one used in the Second Book of Kings for the prophet Elijah’s ascent into heaven (2 Kings 2:11): *A flaming chariot and flaming horses came … and Elijah went up to heaven in a whirlwind.*\n\nBut for Jesus, “going up” will not be in a fiery chariot. His “ascent” will end up in a huge plunge downwards into humiliation and death. The hill of Golgotha was high and barren and his life’s ending was low and shameful.\n\nFrom this point, for the next ten chapters, Luke will skillfully trace Jesus’ deeds in his urgent trip to Jerusalem. Maybe we can see now why Jesus was so severe with people in the reading for today. He knew what going up to Jerusalem would mean.\n\nThere is a question contained in all this, one we should think about. Do we want to go along with this man on his journey? What if we hear him say, “the Son of Man has nowhere to rest his head.” Neither will we. Or, “no one who sets a hand to the plow and looks back is fit for the kingdom of God”? Very harsh.\n\nWouldn’t you or I and turn on our heels and run away?\n\nYes, certainly.  But think about it. Jesus is saying that Christianity (and Catholicism) are *challenges*, not just warm blankets. Jesus values God more than safe sleep, than family funerals, even more than mere courtesy to relations and friends. None of these are evil or bad, they are good. But they receive their worth from love. They are rooted in God-love as was Jesus’ life. The primary reason for our existence and our deeds is the mission Jesus so urgently invites us to.\n\nLove of God above all.\n\nLove of our neighbor as ourselves, no matter what.",
   "father": "Welcome Father Martin",
   "source": "Source of reflection: John Foley SJ, © 2022, https://liturgy.slu.edu/13OrdC062622/reflections_foley.html\nSource of image: http://www.archivioradiovaticana.va/storico/2016/06/22/thirteenth_sunday_%E2%80%93_june_26,_2016/en-1239004",
   "reading1": "1 Kgs 19:16b, 19-21",
   "reading2": "Gal 5:1, 13-18",
   "reading3": "Lk 9:51-62",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1656799200000",
         "date": "3 July",
         "description": "Our next **social gathering** will take place after Mass!"
      }
   ],
   "colors": {
      "color1": "#194D33",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, our bulletin for Sunday, June 25, is now available online. Have a blessed Sunday!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2022-06-26-thirteenth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2022-06-26-thirteenth-sunday-in-ordinary-time.markdown"
}