{
   "date": "July 10, 2022",
   "dateChanged": "2022-07-09 09:40:05 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Th%C3%A9odule-Augustin_Ribot_-_The_Good_Samaritan_-_WGA19393.jpg/800px-Th%C3%A9odule-Augustin_Ribot_-_The_Good_Samaritan_-_WGA19393.jpg?20110625083420",
      "layout": "left",
      "size": 55
   },
   "title": "Fifteenth Sunday in Ordinary Time",
   "text": "*Which of these three, in your opinion, was neighbor to the robbers' victim?\"* \n\n*He answered, \"The one who treated him with mercy.\"*\n\n*Jesus said to him, \"Go and do likewise.\"* (Lk 10)\n\n---\n\nWe have heard the parable of the man who came from Jerusalem and went down to Jericho. He fell among the robbers because it was his own will to go down to that site. The robbers, then, are those about whom Christ says: \"All who came before me were thieves and robbers.\" When he left Jerusalem and descended, he fell into their hands, they robbed him, and beat him. What were those blows, what those wounds, with which the man was wounded? It was the aberrations and the sins.\n\nOn the same path, first a priest, then a Levite went down; they had perhaps already done good for other people, but not for this one, this man who had gone down from Jerusalem to Jericho. Both the priest and the Levite saw him. They stand, in my opinion, the first for the law, the other for the prophets. So they see him, but pass by and leave him lying there.\n\nObviously, the half-dead man was supposed to be entrusted to him who was stronger than the law and the prophets, namely the Samaritan. This name means something like \"guardian\". He is the \"Guardian of Israel who neither sleeps nor slumbers.\" (Ps 121,4) This Samaritan bears our sins and suffers for us, he carries the half-dead man, brings him to the church, which takes in everyone, who does not deny their help to anyone, and to which Jesus invites all, saying: \"Come to me, all of you, you who are weary and burdened, and I will give you rest\".\n\nWe too can follow Christ and have mercy on those who have fallen among the robbers. We can get close to them, we can bind up their wounds, pour oil and wine on them, place them on our own mount and carry their burdens. For this is what the Son of God calls us to do; for he does not so much as say to the teachers of the law only, but rather to all of us: \"Go and do likewise!\" If we act in the same way, we will attain eternal life in Christ Jesus, to whom be the glory and the power for ever and ever. Amen.\n\n(from a sermon by Origen (185-254 a.d.) on the Gospel of Luke)",
   "father": "Welcome Father Martin",
   "source": "Source of reflection: Sermon by Origan, summarized and translated by Fr. M. Müller SJ\nSource of image: Augustin Théodule Ribot, \"The Good Samaritan\" (1870), via https://commons.wikimedia.org/wiki/File:Th%C3%A9odule-Augustin_Ribot_-_The_Good_Samaritan_-_WGA19393.jpg",
   "reading1": "Dt 30:10-14",
   "reading2": "Col 1:15-20",
   "reading3": "Lk 10:25-37",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1657404000000",
         "date": "10 July",
         "description": "We invite young children to join us for our monthly **Childrens' Church** during Mass (parallel to the Liturgy of the Word part)."
      },
      {
         "epoch": "1657404000000",
         "date": "10 July",
         "description": "Opportunity to receive the **Sacrament of Reconcilication** after Mass, at the parish office."
      }
   ],
   "colors": {
      "color1": "#9D0000",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, our bulletin for July 10 is now online. We read the Gospel of the Good Samaritan this Sunday.\nAfter Mass this week: Opportunity for confessions. We wish you a blessed Sunday!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2022-07-10-fifteenth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2022-07-10-fifteenth-sunday-in-ordinary-time.markdown"
}