{
   "date": "July 24, 2022",
   "dateChanged": "2022-07-23 10:30:52 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Lord%27s_Prayer_in_Tamil.JPG/800px-Lord%27s_Prayer_in_Tamil.JPG?20111225070106",
      "layout": "left",
      "size": 100
   },
   "title": "Seventeenth Sunday in Ordinary Time ",
   "text": "One day the disciples saw Jesus praying. When he had finished, one of them asked him: Lord, teach us to pray. Jesus follows this request and entrusts the disciples with five petitions - five petitions that could not be more unexpected. Who would think of talking to God like that?\n\nWhen you pray, say: Father, let your name be hallowed. Without introduction, without prior apology for harassment, Christians may address God as their \"Father\". God, the Holy One, the wholly Other than themselves. But this means that with the first word with which Jesus teaches his own to pray, he takes them into his own relationship with God - into a community of trust that is disguised by nothing and that alone, through the peace of heart that it gives, constitutes the whole happiness of a human soul: Abba, dear Father, who created me and who now carries me.\n\nAnd then the first petition. Only those who have no purpose or intention in their prayers can make this request. He who can speak in this way is happy that God wants to be his Father: 'May your name be hallowed’.\n\nThis means: To you, to your name, that is, to the Father's name, be given the honour. Because you are there for us, as this name says, you shall first of all be praised and thanks shall be given to you. Let all the world know you and sing to you.\n\nBecause you are our good Father, your praise can be more important to us than the most urgent requests. For we are certain that our requests and our prayers for our lives to turn out well - that these requests and their answers are already taken care of in your Fatherhood. Certainly sometimes differently than we ourselves wish or hope and imagine. But they are irrevocably and unforgettably preserved in your sympathy for us. \n\n[...] God, the good Father, in the beginning and in the end. His name is the soul of the Lord's Prayer. And now we can also understand from where Jesus, in the two parables of the friend who asks for bread and of the father who would never give his son a snake instead of the fish he asked for, draws his incontrovertible certainty that God will answer his and our prayer of the Lord's Prayer without fail.\n\nHe will hear it, because he who prays in this way gives himself completely to God, body and soul.\n\nThose who pray in this way trust that the one who is truly called Abba, dear Father, never wishes us ill, even when our supplication seems unanswered.\n\nEvery prayer that follows the basic pattern of the Lord's Prayer may be answered. No, it is answered. You can check for yourself that this is true: From time to time, compare what has happened to you with what you have prayed for. And if there is a difference between the two, then think about how you should have prayed so that your prayer would have matched what happened to you. It will always be a prayer close to the Lord's Prayer. That is why we need to rehearse the Lord's Prayer today and every Sunday and pray it every day.",
   "father": "Welcome Father Martin",
   "source": "Source of reflection: Martin Müller SJ (2022) - shortened\nSource of image: Lord's Prayer in the Church of Pater Noster, by Anton Croos (CC BY-SA 3.0), https://commons.wikimedia.org/wiki/File:Lord%27s_Prayer_in_Tamil.JPG",
   "reading1": "Gn 18:20-32",
   "reading2": "Col 2:12-14",
   "reading3": "Lk 11:1-13",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [],
   "colors": {
      "color1": "#2D867E",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends of ICCH, our bulletin for July 24th, can now be found online. The reflection by Father Martin deals with the Lord's prayer that Jesus teaches the disciples in the Gospel passage read at Mass. We wish you a blessed Sunday!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2022-07-24-seventeenth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2022-07-24-seventeenth-sunday-in-ordinary-time.markdown"
}