{
   "date": "August 21, 2022",
   "dateChanged": "2022-08-06 10:02:16 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Der_breite_und_der_schmale_Weg_2008.jpg/1627px-Der_breite_und_der_schmale_Weg_2008.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Twenty-first Sunday in Ordinary Time",
   "text": "####From the commentary of the holy bishop John Chrysostom on the Gospel of Matthew 26:4-8\n\nChrist helps us by speaking of the kingdom of God in all his miracles and seeking to win all to it. He threatens some that they will be excluded from the kingdom of God, but he threatens only so that they may learn fear through his words and thereby be drawn to heaven. For it is said, **\"For many of the first shall be last, and many of the last first.\"** There have been many who had already ascended to heaven and had shown the greatest moral strength, but who nevertheless, because of a little carelessness, came to fall and fell into the deepest life of sin. Others, on the other hand, pulled themselves out of the depths, climbed up to heaven and entered the angelic state. \n\nNumerous examples of this kind can be found in the Holy Scriptures, but also in our daily lives. David, in a moment of carelessness, fell into the deepest abyss of sin, but he quickly rose again. We may not be stronger than David, but still we should not look merely at his sin, but at the fact that he made atonement for sin. Consider this: the virtue of the man only makes the reproach greater. Not everything is judged alike in all. \"The mighty,\" it is said, \"shall be severely judged,\" and, \"He that knows the will of his Lord, but does it not, shall be severely punished.\" Greater knowledge, then, is the cause of greater punishment. David would have had many reasons to become despondent, first of all because of the greatness of his sin, then also because of the fact that he did not fall at the beginning of his life, when one is still full of hope, but only at the end.\n\nSo let us arm ourselves with good works, and if any sin comes upon us, let us wash it away. If we have lived this life to the glory of God, we shall also enjoy the life to come. May it be granted to us all through the grace and love of our Lord Jesus Christ, who has the glory and the power for ever and ever.",
   "father": "Welcome Father Martin",
   "source": "Source of reflection: excerpt from a comment by John Chrysostom (347-407)\nSource of image: \"Der breite und der schmale Weg\" (\"The Broad and the Narrow Road\"), 1866, by Charlotte Reihlen (idea) and Paul Beckmann (execution) // https://commons.wikimedia.org/wiki/File:Der_breite_und_der_schmale_Weg_2008.jpg",
   "reading1": "Is 66:18-21",
   "reading2": "Heb 12:5-7, 11-13",
   "reading3": "Lk 13:22-30",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1661032800000",
         "date": "21 August",
         "description": "We will have our monthly opportunity to receive the **Sacrament of Reconcilication** (confessions) this Sunday, as usual after Mass in the parish office."
      }
   ],
   "colors": {
      "color1": "#2D4586",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 14.5,
         "size": 12.5,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, find our most recent bulletin for August 21 now online on our website.\nOur monthly opportunity for confessions comes off this Sunday after Mass.\nHave a blessed Sunday!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2022-08-21-twenty-first-sunday-in-ordinary-time.html"
   },
   "saveAs": "2022-08-21-twenty-first-sunday-in-ordinary-time.markdown"
}