{
   "date": "September 4, 2022",
   "dateChanged": "2022-09-03 10:58:56 +02:00",
   "image": {
      "enabled": true,
      "src": "https://2.bp.blogspot.com/-cqOAHAU0pkc/V7rH4XNd1VI/AAAAAAAAC08/ecTHsKOahdcjrKz89gbmMgJg-Q9jqmMIgCPcB/s640/anyone-who-does-not-carry-the-cross-cannot-be-my-disciple.png",
      "layout": "left",
      "size": 72.5
   },
   "title": "Twenty-third Sunday in Ordinary Time ",
   "text": "\n####From a sermon by Pope St. Gregory the Great(*) on the Gospel of Luke 37:2,3,5\n\nMay we ask how it is that the Lord commands us to hate our parents and our biological relatives, when He gives us the commandment to love even our enemies? Paul speaks: \"Husbands, love your wives as Christ loves the Church.\" Behold, the disciple proclaims that the woman is to be loved, while the Master says:\n\"He who does not hate his wife cannot be my disciple.\" Does the judge proclaim something other than what the herald shouts? Or can we hate and love at the same time?\n\nYes, if we consider the meaning of the commandment, we can do both with right discernment, that is, we can love those who are related to us by bodily kinship - namely, when we see in them our neighbours - but we can also hate and avoid them, namely, when we experience and have to endure them as adversaries on the way to God. In this world, even every enemy is to be loved; but an adversary on the way to God must not be loved, even if he is a relative. For he who desires the eternal must, in the cause of God which he makes his own, give up attachment to father, to mother, to wife, to children, to relatives, even to himself, that he may all the more truly know God.\n\nThe truth announces how to realise hatred against oneself. She says: \"Whoever does not carry his cross and follow me cannot be my disciple\". After all, \"cross\" comes from \"crucify\". We bear the cross of the Lord in two ways, namely, when we keep ourselves in discipline through abstinence and when we make our neighbour's need our own need through our compassion. Whoever feels pain in the face of another's distress carries the cross within himself.",
   "father": "Welcome Father Martin",
   "source": "Source of reflection: (*)Pope Gregory I (c. 540–604), commonly known as Saint Gregory the Great, was Bishop of Rome from 3 September 590 to his death in March 604.\nSource of image: Pixabay, https://pixabay.com/p-66700/?no_redirect, via www.liturgytools.net",
   "reading1": "Wis 9:13-18b",
   "reading2": "Phmn 9-10, 12-17",
   "reading3": "Lk 14:25-33",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1662242400000",
         "date": "4 September",
         "description": "Opportunity for **confessions** is offered for once **before Mass, at 11:30-12:30** in the parish office."
      },
      {
         "epoch": "1662242400000",
         "date": "4 September",
         "description": "Our youngest members are invited to **Childrens' Church** during the Liturgy of the Word part of the Mass."
      },
      {
         "epoch": "1662242400000",
         "date": "4 September",
         "description": "After Mass, our monthly **Social Gathering** offers opportunity to spend some time together as a community over coffee and snacks. If possible, bring something edible to share with everyone. You might also consider joining us for the set-up where helping hands are always needed (come from 12:30 on!)."
      },
      {
         "epoch": "1662847200000",
         "date": "11 September",
         "description": "Time to officially say our farewell to Father Martin. Make sure to all be there!! We will be joined by Father Brandt from the City Church of Heidelberg on this occasion."
      }
   ],
   "colors": {
      "color1": "#408BBF",
      "color2": "#D2BC79",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, our weekly bulletin for September is now online.\nThis week: Confessions before Mass (11:30-12:30), Childrens' Church, Social Gathering. Please join in!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2022-09-04-twenty-third-sunday-in-ordinary-time.html"
   },
   "saveAs": "2022-09-04-twenty-third-sunday-in-ordinary-time.markdown"
}