{
   "date": "May 7, 2023",
   "dateChanged": "2023-04-22 09:30:15 +02:00",
   "image": {
      "enabled": true,
      "src": "https://diglib.library.vanderbilt.edu/cdri/jpeg/Jesucristo-CapillaDivinoRostro-MDP287w5.jpg",
      "layout": "left",
      "size": 40
   },
   "title": "Fifth Sunday of Easter ",
   "text": "[...In this Sunday's Gospel,] Christ is explaining the very deepest meaning of Christianity.\n\n“There are many rooms in my Father’s house,” Jesus says. “I will come back and take you there. You know the way to where I am going.”\n\nThomas asks rather naturally, “Master, we do not know where you are going; how can we know the way?” He might as well have said, “Do your magic.”\n\nSo Jesus makes a play on “the way.” Thomas thinks these words mean a roadway or a pathway. But Jesus means something else. He says, Thomas, you already know The Way quite well. It is me. I am the Way and the Truth and the Light. I am the Pathway to the Father. If you know me then you know the Father.\n\nThe early followers of Jesus actually called their Jesus movement, “the Way,” instead of “Christianity.” All puns aside, what does “the Way” mean?\n\nIt is the way to real life. Jesus is saying that the Father has been shown forth completely, in himself, the Christ. Jesus called him “abba,” but he is the God all ages have sought for, the One who is all good and all loving and all powerful. God. Do you want to know God? Look at Jesus. Follow his way.\n\nPhilip does want to know “the Father,” but he completely misses Jesus’ play on the words, “the Way.” He replies, “Master, just show us the Father, and that will be enough for us.” We can’t understand your explanations, just give us the goods.\n\nPeople throughout the ages had said the same thing. We want to know the gods. We want the favor of those exalted ones who have no suffering, no crop failures, no droughts, starvation, no aids, no genocide, no Covid. no death. We want what they have, a luxury, power, honor, and glory. Show us that Father, Philip says.\n\nMaybe you and I say exactly the same thing! We are so attracted to the itches of our heart: to have exactly what we want, to avoid troubles, to live “the good life.” As television says, “it doesn't get any better than this.” Oh doesn't it?\n\nJesus' response: “show you the Father? *What Are You Saying, Philip? I AM showing you the Father*. God is so present in my life (and death and resurrection) that to know me is to know the Father.”\n\nLet the meaning in. Jesus seems to say that God is totally within him. They are one. You can see infinite love revealed!\n\nCan you or I look at the Cross and the Resurrection and see God’s infinite love embedded there? Can we see a love that is stronger than death, stronger than honor, power, riches, stronger than a “trouble-free life”?\n\nIt is The Way to freedom.",
   "father": "Welcome Father Bernward",
   "source": "Source of reflection: © 2023, Fr. John Foley SJ, https://liturgy.slu.edu/5EasterA050723/reflections_foley.html\nSource of image: Anonymous: \"Christ as The Way, The Truth, The Life\", from Art in the Christian Tradition, a project of the Vanderbilt Divinity Library. https://diglib.library.vanderbilt.edu/act-imagelink.pl?RC=57829 [retrieved May 5, 2023]. Original source: https://commons.wikimedia.org/wiki/File:Jesucristo-CapillaDivinoRostro-MDP.jpg.",
   "reading1": "Acts 6:1-7",
   "reading2": "1 Pt 2:4-9",
   "reading3": "Jn 14:1-12",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1683410400000",
         "date": "7 May",
         "description": "During the Liturgy of the Word part of the Mass, our monthly **Children's Church** invites the youngest members of our community to join us in the sacristy for a child-friendly approach to the readings and their content. Kids can join on their own or with a parent."
      },
      {
         "epoch": "1683410400000",
         "date": "7 May",
         "description": "After Mass, you are warmly invited to stay a while for our monthly **social gathering** and get to know and socialize with your fellow parishioners, old and new. Coffee and water provided as usual, please bring a dish or some snacks to share with everyone if possible. \nWe're also hoping that a number of you will be there to help setting up before Mass (please come at 12:30!!) or for clean-up later."
      }
   ],
   "colors": {
      "color1": "#4083BF",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends of ICCH,\nour bulletin for May 7 is now available online. \nWe hope you join us this Sunday for Mass (with children's church!) and our monthly social gathering afterwards.\nIf possible, bring a dish to share, or consider helping with the set-up, from 12:30 on.",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2023-05-07-fifth-sunday-of-easter.html"
   },
   "saveAs": "2023-05-07-fifth-sunday-of-easter.markdown"
}