{
   "date": "June 4, 2023",
   "dateChanged": "2023-06-03 08:04:06 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Angelsatmamre-trinity-rublev-1410.jpg/1024px-Angelsatmamre-trinity-rublev-1410.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "The Solemnity of the Most Holy Trinity",
   "text": "Today the entire Church celebrates the great Feast of the Most Holy Trinity. Because this is such a special feast day we will, as we did last week, use this space to talk about the Trinity\nrather than the individual readings. In this way I believe that you will get a much better understanding of the central theme.\n\nThe Trinity is the most complex and yet profound concept within all Church teachings. If you don't fully understand the Trinity, don't be overly concerned because no one fully understands it. It is a great and yet wonderful mystery, not in the sense of a “murder mystery” but a mystery too great to be understood by mere mortals. Great because it embodies the very triune nature of God and Wonderful because it permits God to be who He is - that which is above and beyond all creation. Can you think of anything that is greater than God?\n\nThroughout the seasons of Lent and Easter we heard much about the Father sending His Son Jesus to earth to teach mankind how to live and then afterward to be the sacrificial offering to atone for the sins of mankind. On Pentecost Sunday we hear about the Holy Spirit and His role in directing and guiding the People of God, the Church, toward salvation. These three Persons, Father, Son and Holy Spirit, collectively are called the Holy Trinity; however, they are all within the One True God. This is why it is a mystery. We mere mortals can only “see” it from the human point of view and not from the divine view, and that is probably a good thing. Would you really want to understand everything about God and humanity? Perhaps we will someday.\n\nIn the Readings at Mass for this Feast, we honor all three Persons of God. From the\nBook of Exodus we hear of the Father giving the Law, the Ten Commandments, to Moses. In the Book of Wisdom and Proverbs we read where the \"Spirit of Wisdom,” who is usually considered to\nbe the Holy Spirit, is with the Father at the event of creation of the world. From the Book of Daniel in the Responsorial Psalm we hear the praises of the Father for His creation, which\nbrought forth the Son of Man, Jesus Christ. Finally in the Second Reading and the Gospel, we again have all three Divine Persons represented. So, where do you and I fit into this picture?\n\nWe are the reason that: All creation by the Father, the Life, Death and Resurrection of the Son, together with the guidance of the Holy Spirit came to be. All of this was gifted to mankind out of God's divine love in order that He might share Himself with mankind, the only part of creation made in the “image and likeness” of God that can respond to Him in His love. Are you\nresponding? This great feast day and this great mystery should not be passed over without some thought given to your relationship to the Trinity. Something to think about during your prayer time this week! MFB",
   "father": "Welcome Father Eckhard",
   "source": "Source: https://stclareroseville.org/commentary\nImage: Andrei Rublev - The Trinity",
   "reading1": "Ex 34:4b-6, 8-9",
   "reading2": "2 Cor 13:11-13",
   "reading3": "Jn 3:16-18",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1685777339272",
         "date": "3 June",
         "description": "We will have social gathering after Mass this Sunday. Please bring along some time and somrthing small to share."
      }
   ],
   "colors": {
      "color1": "#CECA2F",
      "color2": "#000",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2023-06-04-the-solemnity-of-the-most-holy-trinity.html"
   },
   "saveAs": "2023-06-04-the-solemnity-of-the-most-holy-trinity.markdown"
}