{
   "date": "October 1, 2023",
   "dateChanged": "2023-09-30 11:31:05 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/%D0%9A%D0%B0%D1%80%D1%82%D0%B8%D0%BD%D0%B0_%22%D0%9F%D1%80%D0%B8%D1%82%D1%87%D0%B0_%D0%BE_%D0%B4%D0%B2%D1%83%D1%85_%D1%81%D1%8B%D0%BD%D0%BE%D0%B2%D1%8C%D1%8F%D1%85%22.jpg/320px-%D0%9A%D0%B0%D1%80%D1%82%D0%B8%D0%BD%D0%B0_%22%D0%9F%D1%80%D0%B8%D1%82%D1%87%D0%B0_%D0%BE_%D0%B4%D0%B2%D1%83%D1%85_%D1%81%D1%8B%D0%BD%D0%BE%D0%B2%D1%8C%D1%8F%D1%85%22.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Twenty-sixth Sunday in Ordinary Time",
   "text": "For the past two Sundays the readings have focused on sin and forgiveness. The theme\ncontinues today. In the Responsorial Psalm we recalled God’s mercy and God’s steadfast love.\nThe Hebrew word translated here as ‘mercy’ comes from the word for a womb. The Psalmist\nbelieves that God feels for us the way a mother feels for the child in her womb: feelings of\ntenderness, protective care, hope and love. The Hebrew word translated here as steadfast love\nrefers to God’s commitment to the people of Israel. We think of the commitment God has made\nto us when God breathed our soul into us at the first moment of our conception: a promise that\nGod would never abandon us, but would continue to offer us his Spirit and his grace so that we\nmight, in the words of Jesus, ‘live and to live to the full’(John 10:10).\n\nThe Psalmist recalls God’s mercy and love because he is very conscious of his own sinfulness. He\nasks God to remember him but not his sins. We all tend to be very conscious of our own\nmistakes, failures and sins. Today’s Psalm reminds us that we do not really know ourselves by\nlooking at our faults. They are part of the picture, but we only really know ourselves when we\nsee ourselves as God sees us. This means that, while acknowledging our sins and trying to do\nsomething about them, we must learn to look at ourselves with the same mercy and love which\nGod has for us, the mercy and steadfast love which most of us find easier to give to others than\nto ourselves.\n\nThe Psalmist knows he has a lot to learn. He is floundering, bewildered, lost; but he knows also\nthat his heart is seeking God and he trusts that God wants to save him and teach him how to live\nso as to reach his heart’s desire. He therefore prays, and the Church invites us today to pray\nwith him: ‘O God, let me know your ways. Teach me your paths. Make me walk in your truth’.\nSome of the ways we have been following, some of the paths we have been treading, some of\nthe things we have taken as true have not brought life, to us or to those we love. God knows us\nthrough and through and God knows what ways are best, what paths will take us to our desired\ndestiny and what is really true and can be relied on.\n\nFinally, the Psalmist acknowledges the importance of humility. This is because it is our pride that\nblinds us to the harm that our sinful behaviour is causing, and so blinds us to the ways in which\nour lives need to change.\n\nHow does God reveal his ways? The best answer is found by looking at Jesus and responding to\nhis invitation to come and follow him. Jesus said of himself: ‘I am the Way’(John 14:6). This is\nthe theme of the Second Reading. Jesus is presented to us as our model in humility and Paul\nasks his friends in Philippi to think as Jesus thinks. If we think as Jesus does we will avoid selfish\nambition: we will cease focusing attention on what we want without regard to the needs of\nothers or to the effects which our self-­‐centred behaviour is having on those around us. If we\nthink the way Jesus thinks we will not be conceited: that is to say, we will not act as though we\nwere the centre of the world and that everyone has to fit in with us. We will not think it alright\nto say what we like to others, not caring whether it hurts their feelings or not. Like Jesus we will\nrespect the sacred in others.\n\nWe are invited to respond to Jesus’ invitation: ‘Come to me for I am gentle and humble in heart’\n(Matthew 12:29). We will stop looking down on others and learn to look up instead. Sometimes\nother people’s faults stand out in such a way that they are obvious to everyone. We are not\nbeing asked to pretend. But we are asked to remember that we do not know where people are\ncoming from; we do not know what pressures they are under now or what deprivations they\nmay have had to suffer in the past. We are in no position to judge others, so, when they behave\nbadly to us or to others, we should pray with Jesus: ‘Father, forgive them for they do not know\nwhat they are doing’(Luke 23:34).\n\nThe Gospel reminds us that the most important thing for us is to do the will of God. This is not a\nmatter only of words or of good intentions. It is a matter of decision. Jesus could say of himself\nthat he always did what was pleasing to his Father. Let us watch Jesus, let us follow him, and let\nus pray that his Spirit will so inform our minds and hearts that we too will want only what God\nwants and find our pleasure in doing God’s will.\n\nHow do we know God’s will? The community can be of great help to us here. We have a long\nand rich tradition that holds a good deal of wisdom, for it is the product of the reflections and\nsaintly lives of millions of disciples of Jesus. We are rather foolish if we think that we know\nbetter than the Church. Sometimes, in particular instances, what is presented as Church\nteaching concerning human behaviour is not based on faith or on properly assessed human\nexperience. In matters that are not central to our communal faith there can be room for\ndisagreement. But if we always think we know better than the community, and if we fail to take\nnotice of the ordinary wisdom that is contained in time-­‐honoured teaching, we are neglecting a\nmost important source for the discovery of God’s will.\n\nIn all matters, however, our conscience is primary. By conscience we do not mean our personal\npreferences. We do not mean the way we happen to look at things. We are not referring to our\nprejudices or what gratifies our self-­‐interest. We are talking about the sacred encounter\nbetween God and ourselves that takes place in the depths of our being. Whatever advice we\nreceive from others, we must take it to prayer and listen to our hearts where God is inspiring us\nto follow his ways. God is calling each of us to take a step in love from where we now are.\nUltimately only we can know what that step is, for only we can know our readiness and where\ngrace is leading us at this moment. The art of obedience, therefore, is based on a humble\nlistening to others and a courageous trust in God, whose Spirit is inspiring us to do the truth in\nlove.\n\nWe know how much we need forgiveness from God. Every time we pray the ‘Our Father’ we\nsay: ‘Forgive us our trespasses as we forgive those who trespass against us’. Jesus insists that we\nmust ‘forgive our brother or sister from our heart’(Matthew 18:35). Sometimes we are like the\nsecond son in today’s Gospel. We find ourselves saying: ‘Certainly, I will do your will. I will\nforgive them’. But when we continue to feel hurt and we are called to forgive as we have said\nwe would, does our heart reach out like that of Jesus and offer a healing forgiveness or do we\nallow our heart to close in on its hurt, blocking out any mercy or love?\nUnderstanding is not sufficient. Forgetting is not possible or helpful. The passing of time of itself\ndoes not heal. We are asked to be open to a genuine change of heart on the part of the one who\nhas offended us, and we need the largeness of heart to accept this change and to give love\ngraciously. Jesus gave us his broken body and poured out his love for us from his broken heart.\nAt the last supper he said that he was doing this ‘so that sin might be forgiven’(Matthew 26:28).\nWhen we accept the host and drink from the cup at this Eucharist we are saying that we will do\nwhat he does. May our broken lives witness to our desire to further Jesus’ dream, for only\nthrough forgiveness can we sinful human beings find the courage to continue our journey to the\nheart of God.",
   "father": "Welcome Father Bernward",
   "source": "Source: https://mbfallon.com/homilies_yearA,pdf/sunday26.pdf\nImage: Andrei Mironov: Parable of the Two Sons",
   "reading1": "Ez 18:25-28",
   "reading2": "Phil 2:1-11",
   "reading3": "Mt 21:28-32",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1696716000000",
         "date": "8 October",
         "description": "There will be Social Gathering after Mass on October 8th. Kindly take note of this; we look forward to seeing you there."
      }
   ],
   "colors": {
      "color1": "#3BBD00",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2023-10-01-twenty-sixth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2023-10-01-twenty-sixth-sunday-in-ordinary-time.markdown"
}