{
   "date": "December 10, 2023",
   "dateChanged": "2023-12-10 12:37:56 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Michelangelo_Cerquozzi_-_Saint_John_the_Baptist_Preaching_in_the_Wilderness.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Second Sunday of Advent",
   "text": "“Comfort, comfort my people.” The prophet of the first reading is told that the time of misery is coming to an end.Comfort the people. Let them know that God is going to\ncome to free them from their sadness and their pain.\n\nRight now, we need comforting. We are living in very difficult times. Politics has polarized us. People don’t just disagree with each other, they show anger and even hatred towards those who hold a different opinion then they do. Some Republicans shout out that all Democrats are communists. Some Democrats shout out that all Republicans are fascists.\n\nOur Church is also divided between those who want a return to a traditionalist faith where Mass is celebrated in Latin and those who want the Church to continue developing with the times. Deeper than that, there are those who treat the Holy Father as a heretic, and those who treat anyone who questions Rome as being a schismatic. This is very stressful for us all.\n\nMany of our families have had difficult years with horrible tragedies. Life as they knew it will never return. They need comforting.\n\nWe all need comforting. That is a great word, comfort. We remember how when we were little our Moms or Dads used to tuck us in for the night. They made sure that we were comfortable so we could sleep peacefully. Comfort is the feeling of peace, of release from stress, of freedom from all that is hurting us.\n\nThe prophet of the first reading promised comfort to the people. He told them that God was aware of their pain and suffering. They had been held captive by the Babylonians for fifty years. They were totally powerless. They had been led to Babylon with hooks through their noses. They had to serve the pagan kings of Babylon. There was no way that they could be\nfreed. They had no army, no means of rebelling. But then, after the prophecy that God is coming to bring comfort to the\npeople, political events resulted in their being freed to return to Judea and Jerusalem. Babylon was conquered by Persia,\nand the new power released all the captive peoples to return to their homelands. God found a way to bring comfort to his\npeople.\n\nPeople are looking for comfort. They may not realize it, but they are looking for God. It is up to us to tell them that Divine\nHelp is near. “Prepare the way of the Lord,” John the Baptist calls out in the Gospel reading for the Second Sunday of\nAdvent. We are called to tell people that God is in control. He is going to free us from all that is attacking us. We have got to\ntell people to have faith and trust in God. We are called to let others know that comfort is near. More than that, we are\ncalled to let them know that Jesus, the Divine Comforter, is here.\nWe can do this if our faith is the very center or our lives. We can do this if our lives are motivated by the presence of the\nLord within us. We can proclaim comfort by living our Christianity. The decisions that we make in life, the way that we treat\nother people, the very way that we approach our day, must reflect the presence of Christ within us. People need us to be\nmen and women of faith. People need our witness to our Christianity.\nOthers are dependent on us. We must prepare them to receive the Lord in their lives. We must bring comfort to God’s\npeople.",
   "father": "Welcome Father Chinedu",
   "source": "Source: https://frjoeshomilies.net/12-10-23.pdf\nImage: Michelangelo Cerquozzi - Saint John the Baptist Preaching in the Wilderness",
   "reading1": "IS 40:1-5, 9-11",
   "reading2": "2 PT 3:8-14",
   "reading3": "MK 1:1-8",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1702165274561",
         "date": "10 December",
         "description": "There will be confessions in English on Sunday, December 10th, before (12.30 - 12.50) and after Mass."
      },
      {
         "epoch": "1702165277535",
         "date": "10 December",
         "description": "Kindly take note of the following dates, on which there will be more opportunities for receiving the Sacrament of Penance and Reconciliation: December 17th (BEFORE Mass) and December 24th (AFTER Mass)."
      }
   ],
   "colors": {
      "color1": "#9B00BD",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2023-12-10-second-sunday-of-advent.html"
   },
   "saveAs": "2023-12-10-second-sunday-of-advent.markdown"
}