{
   "date": "December 17, 2023",
   "dateChanged": "2023-11-25 08:01:45 +02:00",
   "image": {
      "enabled": true,
      "src": "https://3.bp.blogspot.com/-D4w4bWWRyjo/WigQ09foaOI/AAAAAAAAGWw/H9fOvof2ZF8AFc9o3lTZ06HRCBtVEW6ZQCKgBGAs/s1600/john-the-baptist-announcing-jesus.jpg",
      "layout": "left",
      "size": 42.5
   },
   "title": "Third Sunday of Advent ",
   "text": "**“I am the voice of one crying out in the desert, ‘make straight the way of the Lord,’” as Isaiah the prophet said.”** John 1:23\n\nIn the passage above, Saint John the Baptist quotes Isaiah 40:3: “A voice proclaims: In the wilderness prepare the way of the LORD! Make straight in the wasteland a highway for our God!” This was a prophecy of Isaiah who was speaking about the return of the Jewish exiles from Babylon back to Jerusalem. Normally, people would travel along the well-watered routes from Mesopotamia to Israel. Those routes were safer than the desert and provided the necessary food and water for the journey. But Isaiah prophesied that the Jewish exiles would travel the shortest route—straight across the desert—and that God would provide for their needs during that journey. Such a journey required much trust in the providence of God.\n\nJohn the Baptist, in quoting Isaiah, applies this prophecy to himself. He was called to cry out in the desert and point people directly to the Messiah. It was in the desert that they would discover their Savior.\n\nFirst of all, John cries out in the “desert.” His message is for those who experience dryness, destitution, need and loss in life due to sin. His message of repentance is first for those who are without the spiritual nourishment God wants to bestow upon them through grace. The message of John is pointed to those who humbly see the difficult situation they are facing in life and acknowledge their need for the Living Water of the Savior of the World.\n\nSecond, this new “straight” way implies that many are not walking the direct path to Christ. Instead, they are taking unnecessary detours in life. John’s message is one that calls everyone to the straight and direct way of repenting of their sins so that they can come to faith in Christ Jesus.\n\nThird, walking through the desert to find Christ requires trust in God’s providence. It takes courage to make such a journey. Trust in the ongoing providence of God, Who promises to meet all of our needs, is key. One would not walk straight through the desert if they did not trust their guide.\n\nAdvent is a time to reexamine the road you are on. Are you trying to find your own way to happiness? Are you trusting in your own abilities, your own intelligence and your own plan for the future? If so, then listen to the “voice of one crying out in the wilderness.” Listen to Saint John speak to you, calling you to the simplicity of the desert, to a greater detachment from all things, to an abandonment of all that is not of God, and to a more willing trust in the providence of God to lead you.\n\nReflect, today, upon this calling from the desert and listen to the message God is speaking to you, personally. Abandon all worldly concerns, repent of sin, trust in Him and go out to meet Him so that you can more quickly and more easily come to a deeper faith in our Lord during this Advent season.\n\n*My loving Lord, You are there, waiting for me in the darkness and dryness of my sin. You are waiting for me to lead me and guide me through the many challenges I face in life. Please give me the courage and wisdom I need to trust in You enough to follow You wherever You lead. Jesus, I trust in You.*",
   "father": "Welcome Father Eckhard",
   "source": "Source of reflection: © 2023 My Catholic Life! Inc. All rights reserved. Used with permission. www.mycatholic.life\nSource of image: \"John the Baptist Announcing the Messiah\", Mosaic in Cappella Palatina di Palermo, Italy. http://diglib.library.vanderbilt.edu/act-imagelink.pl?RC=46083",
   "reading1": "Is 61:1-2A, 10-11",
   "reading2": "1 Thes 5:16-24",
   "reading3": "Jn 1:6-8, 19-28",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1702767600000",
         "date": "17 December",
         "description": "If looking for an opportunity to celebrate the Sacrament of Reconciliation in English, here's when before Christmas: On this Sunday, Father Eckhard is available about 45 **before** Mass, though not afterwards."
      },
      {
         "epoch": "1703372400000",
         "date": "24 December",
         "description": "Additional opportunity for confessions, **after** Mass."
      },
      {
         "epoch": "1703458800000",
         "date": "25 December",
         "description": "Please note that Mass on **Christmas Day** starts at **11:00 am**!"
      }
   ],
   "colors": {
      "color1": "#BF407B",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12.5,
         "size": 11.5,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, our bulletin for December 17, the Third of Advent, is now online.\nOpportunities for confessions this week and next - see NEWS section.",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2023-12-17-third-sunday-of-advent.html"
   },
   "saveAs": "2023-12-17-third-sunday-of-advent.markdown"
}