{
   "date": "February 18, 2024",
   "dateChanged": "2024-02-17 06:21:14 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Briton_Rivi%C3%A8re_-_The_Temptation_in_the_Wilderness.jpg",
      "layout": "left",
      "size": 62.5
   },
   "title": "First Sunday of Lent",
   "text": "###What Is Lent?\n\nAsh Wednesday was a few days ago, starting the Lenten countdown toward Holy Week and Easter. But maybe some of us are not completely clear as to why these weeks of preparation are there in the first place.\n\nOne opinion is that Lent is a time to deprive yourself. You give up candy or smoking or desserts or heavy meals or … well, choose your favorite and then give it up. These are part of Lenten practice.\n\nLenten deprivation gave birth to Mardi Gras (literally meaning “Fat Tuesday”). In contrast to the toughness of Lent. Mardi Gras, at least in non-covid-19 years, had you eat all the fat you could, parade around in costume, go wild. The public usually does not recall that Mardi Gras has something to do with what is to them a quaint old practice, Lent. But that sharpens the question: what have they or we forgotten about Lent and its practices? \nWell, what if we described Lent as a “Retreat”?\n\nA Retreat, in Catholic and other religions, is a space of days taken out to pray and to be with the Lord. Often one goes to a retreat house to do these. In St. Louis, for instance, there is a beautiful place called “White House”—different from the one for the president—which has a stunning view of the Mississippi River. For many decades Jesuits have preached retreats there every weekend and sometimes during the week. Sizeable groups of men or women stay for two or three days to meditate, listen to talks, and refresh their spiritual lives.\n\nI am not saying that you should disappear to the nearest retreat house for the five weeks of Lent. But what about letting each Lenten day partake of certain retreat practices? For instance, what about setting aside a little time each day to let your insides settle down for a while, to create a space within you to welcome God. Maybe set up a special place in your home or someplace else just to pray. How about a picture or crucifix or maybe a candle? Or just 10 minutes of silence?\n\nAnd why not use some time to read in advance the gospel from the upcoming Sunday Mass? Sit down, read it slowly, and let the scene described take place within the your heart and mind. This week you could ask Jesus how it felt to have the Spirit drive him into the desert, as described in this week’s Gospel.\n\nThe point?\n\nLet the Lord’s loving deeds be your motivation for “giving up” anything during Lent. Make a gift of gratitude to God—rather than just refraining from something or other. How does any of this prepare you for Holy Week and Easter? By doing exactly what Jesus does when he makes of himself a gift consisting of suffering and death. He is returning a gift of love to the Father. Lent prepares us to witness this reality of our savior. ",
   "father": "Welcome Father Bernward",
   "source": "Source of reflection: © 2024, John B. Foley, SJ, https://liturgy.sluhostedsites.org/1LentB021824/reflections_foley.html\nSource of image: Briton Rivière, \"The Temptation in the Wilderness\" (1898), via Wikimedia Commons",
   "reading1": "Gn 9:8-15",
   "reading2": "1 Pt 3:18-22",
   "reading3": "Mk 1:12-15",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1708210800000",
         "date": "18 February",
         "description": "During the Liturgy of the Word part of the Mass, the youngest members of the community are invited to join us for our first **children's church** in Lent. As usual, this will take place in the room next to the sacristy. We will start the Mass together and come back in time for communion. You may come with or without a parent!"
      }
   ],
   "colors": {
      "color1": "#4043BF",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, \n\nfind our bulletin for this Sunday, February 18, now online.\nFamilies with kids, kindly notice that there will be children's church during part of the Mass tomorrow.\n\nIt is the First Sunday in Lent - we wish all of you a Lenten season filled with God's grace and mercy!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2024-02-18-first-sunday-of-lent.html"
   },
   "saveAs": "2024-02-18-first-sunday-of-lent.markdown"
}