{
   "date": "March 31, 2024",
   "dateChanged": "2024-03-30 02:03:24 +02:00",
   "image": {
      "enabled": true,
      "src": "https://diglib.library.vanderbilt.edu/cdri/jpeg/0000_Mosaics_of_Resurrection_of_Christ.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Easter Sunday - The Resurrection of the Lord",
   "text": "###Holy Saturday with Mother Mary\n\nThe Savior of the World died a cruel death upon the Cross. His broken body was laid in the tomb. His disciples scattered and were fearful that they would be next. But our Blessed Mother kept vigil in the perfect hope that her Son would soon rise.\n\nTraditionally, Saturdays within the Church year are dedicated to the Blessed Virgin Mary. This ancient tradition developed in part due to the belief that, as others were filled with fear and confusion, Mother Mary kept vigil on Holy Saturday in prayerful anticipation of Jesus’ resurrection. She knew her Son would rise. She had hope beyond hope. Her faith was certain. Her love kept her vigilant as she awaited the return of her Son.\n\nFor many centuries, it has been suggested that the first person to whom Jesus appeared after His Resurrection was His own mother. Pope Saint John Paul II believed this. Saint Ignatius of Loyola believed it. And many others throughout the centuries shared this belief.\n\nFor these reasons, Holy Saturday is an ideal day to ponder the pondering heart of our Blessed Mother. There are several times in Sacred Scripture where we are told that Mother Mary pondered the mysteries of her Son’s life in her heart. She was one of the few who stood by Him in His agony and death. She stood before the Cross and prayerfully pondered His perfect sacrifice. The Blessed Mother held His dead body in her arms and pondered where His spirit had gone. And today she keeps vigil, pondering His imminent return to her.\n\nPonder her pondering heart. Try to unite your own heart with hers. Try to understand what she was thinking and hoping. Try to feel what she felt this sorrowful day. Try to experience her faith, her trust and her joyful expectation.\n\nSo many people in this world walk in despair and confusion. So many have lost hope in the new life that awaits them. So many have their own form of interior death without allowing God to draw them into His Resurrection. So many people today need the hope that was so alive in the heart of our Blessed Mother that first Holy Saturday.\n\nPonder the reality of Holy Saturday in silence this day and allow the glorious heart of our Blessed Mother to inspire you and draw you more deeply into her life of faith, hope and love.\n\n*Dearest Mother Mary, on that first Holy Saturday, you kept vigil for your Son. You allowed the divine gift of hope to grow within you, and you allowed that hope to be your strength in the midst of the horror of the Cross. Pray for me that I may ponder your beautiful heart this day so that I, too, may be filled with hope as I endure the challenges of this earthly life. Give me a heart of joyful anticipation as I await the grace of new life our Lord so deeply desires to bestow upon me. Mother Mary, pray for me. Jesus, I do trust in You.*",
   "father": "Welcome Father Eckhard",
   "source": "Sourceof reflection: © 2023 My Catholic Life! Inc. All rights reserved. Used with permission. www.mycatholic.life\nSource of image: Resurrection of Christ, https://commons.wikimedia.org/wiki/File:0000_Mosaics_of_Resurrection_of_Christ.JPG - Eugenio Hansen, OFS",
   "reading1": "Acts 10:34a, 37-43",
   "reading2": "Col 3:1-4",
   "reading3": "Jn 20:1-9",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1711839600000",
         "date": "31 March",
         "description": "Important reminder: Our **Mass on Easter Day** begins at **11am**!"
      },
      {
         "epoch": "1711839600000",
         "date": "31 March",
         "description": "We will continue celebrating the Resurrection of our Lord after Mass with an **Easter social gathering**. If you can, come earlier to help set up (10:30 would be great!) and/or bring a dish to share with everyone else!\nFor the little members of the community, an **egg hunt** will also take place after Mass :)"
      }
   ],
   "colors": {
      "color1": "#FFF",
      "color2": "#BF9740",
      "border": "#333"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends,\n\non this Holy Saturday, find a reflection on waiting with Mother Mary in our recently published bulletin.\nICCH invites you to celebrate the Resurrection tomorrow with Mass at 11am (!), followed by an Easter social gathering and egg hunt for the kids.\nWe hope to see many of you - best wishes & blessings to all our members, whether at church, homebound or travelling!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2024-03-31-easter-sunday-the-resurrection-of-the-lord.html"
   },
   "saveAs": "2024-03-31-easter-sunday-the-resurrection-of-the-lord.markdown"
}