{
   "date": "April 14, 2024",
   "dateChanged": "2024-03-30 02:03:24 +02:00",
   "image": {
      "enabled": true,
      "src": "https://diglib.library.vanderbilt.edu/cdri/jpeg/Duccio_di_Buoninsegna_017.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Third Sunday of Easter ",
   "text": "###The Rest of the Story\n\nWe have all heard the story before. Two disciples walked to a small town, about seven miles from the center of Jerusalem, Emmaus. They were sorrowful—I suppose in the same way all people tend to be when a relative has died.\n\nTheir hero was dead, the man they had thought was the messiah. \n\n Suddenly, they were joined by a stranger. He began explaining to them the story of Christ as foretold in the Hebrew scriptures. When the three of them arrived at Emmaus, they ate, and, as he broke the bread, the men knew in a flash, just who he was.\n\nThen suddenly he disappeared.\n\nThese same men ran to Jerusalem as fast as they could, to tell the eleven apostles about this extraordinary revelation. Sunday’s Gospel tells this part of the story. Surely they were babbling and prattling, being so excited. But in the midst of this excitement, suddenly, without warning, Jesus appeared to them, now in Jerusalem.\n\n  “They were startled and terrified and thought that they were seeing a ghost.”\n\nJesus replied that ghosts do not have flesh and bones, do they? Touch me and know that I am real. He showed them his hands and feet, with the wounds of the cross made beautiful by God’s love.\n\nThen comes Jesus’ best move, a compassionate one. He says he is hungry. How much more un-ghostly could you get? He helps himself to the baked fish they bring him, just as he had done so often in their life together.\n\nHe begins to explain the events which had seemed like pure disaster: the passion, death, and burial in particular. He recalls everything written about him “in the law of Moses and in the prophets and psalms,” just as he had done for the two men on the road to Emmaus. He tells them why the Son of Man had had to suffer, die, and then be raised.\n\nHow did he put it?\n\nSurely he referenced the book of Job, a man who had been loving and moral, but had lost absolutely everything, all of which led to a direct encounter with God (maybe a prefiguring of the crucifixion).\n\nAnd of course, the Book of Isaiah must have been part of it:\n\n*It was our infirmities that he bore, our sufferings that he endured, while we thought of him as stricken, as one smitten by God and afflicted. But he was pierced for our offenses, crushed for our sins. Upon him was the chastisement that makes us whole, by his stripes we were healed (Isaiah 53:4-5).*\n\nThis passage is the heart and soul of the Hebrew scriptures, and, according to our Christian and Catholic belief, of the fulfillment that was Jesus.\n\nWhat about the resurrection? Here is Isaiah again, words had been written centuries before Jesus:\n\n*Because of his affliction he shall see the light in fullness of days; Through his suffering, my servant shall justify many, and their guilt he shall bear. Therefore I will give him his portion among the great, and he shall divide the spoils with the mighty (Isaiah 53:11-12)*.\n\nIn fulfillment of these words the apostles experienced a conversion. Peter went off to preach what God “had announced beforehand through the mouth of all the prophets, that his Christ would suffer,” (First Reading), and would die and be glorified.\n\nThis is the “rest of the story” of Emmaus.\n\nAnd now, since Easter, the rest of our own story.",
   "father": "Welcome Father Bernward",
   "source": "Source of reflection: © 2024, John B. Foley, SJ - https://liturgy.sluhostedsites.org/3EasterB041424/reflections_foley.html\nSource of image: Duccio, di Buoninsegna, -1319?. Christ Appears to the Disciples at the Table after the Resurrection, from Art in the Christian Tradition, a project of the Vanderbilt Divinity Library. https://diglib.library.vanderbilt.edu/act-imagelink.pl?RC=49184. Original source: https://commons.wikimedia.org/wiki/File:Duccio_di_Buoninsegna_017.jpg.",
   "reading1": "Acts 3:13-15, 17-19",
   "reading2": "1 Jn 2:1-5a",
   "reading3": "Lk 24:35-48",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1713045600000",
         "date": "14 April",
         "description": "After Mass, we will have his month's **social gathering**. If by any means possible, come earlier to help the social team set up (around 12:30) and/or bring a dish to share with everyone else!"
      }
   ],
   "colors": {
      "color1": "#FFF",
      "color2": "#BF9740",
      "border": "#333"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends,\n\nour bulletin for this Sunday, April 14, can now be found online.\nKindly take note that our monthly social gathering comes off after Mass - bring something edible to share, some time to get to know your fellow parishioners, and if possible, come a bit earlier to help set up for the social (from 12:30 on)!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2024-04-14-third-sunday-of-easter.html"
   },
   "saveAs": "2024-04-14-third-sunday-of-easter.markdown"
}