{
   "date": "June 9, 2024",
   "dateChanged": "2024-06-09 05:43:12 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Rom%2C_Vatikan%2C_Basilika_St._Peter%2C_Die_Taube_des_Heiligen_Geistes_%28Cathedra_Petri%2C_Bernini%29.jpg/800px-Rom%2C_Vatikan%2C_Basilika_St._Peter%2C_Die_Taube_des_Heiligen_Geistes_%28Cathedra_Petri%2C_Bernini%29.jpg",
      "layout": "left",
      "size": 42.5
   },
   "title": "Tenth Sunday in Ordinary Time ",
   "text": "Jesus lived for his father’s mission on earth. He spent himself for the world that our brokenness might be healed so as to retrace our steps back to the love of God our father. In Jesus’ unrelenting efforts to save the people, some did not appreciate his goodness as asserted in this gospel:   “The scribes who had come from Jerusalem said, ‘He is possessed by Beelzebul,’ and ‘By the prince of demons he drives out demons.” (Mark 3:22).\n\nWhat a disheartening statement this must have been for Jesus. It was an utter misplacement of Jesus’ identity, hence, he warned against such misguided utterance:   “How can Satan drive out Satan?… all sins and all blasphemies that people utter will be forgiven them. But whoever blasphemes against the holy Spirit will never have forgiveness, but is guilty of an everlasting sin.”\n\nThe Catechism of the Catholic Church further sheds light on the sins against the Holy Spirit:   “… There are no limits to the mercy of God, but anyone who deliberately refuses to accept his mercy by repenting, rejects the forgiveness of his sins and the salvation offered by the Holy Spirit. Such hardness of heart can lead to final impenitence and eternal loss (CCC 1864).\n\nIn our world today, we must pay attention to the direction our life is taking. We have the good, the bad and the ugly events and experiences going on in the world, where do you invest your time, treasure and heart? While God’s mercy is limitless, God does not want humanity to take his goodness for granted. Jesus reminds us that there are consequences for our actions especially when we chose on our own to refuse God’s incessant calls for conversion in our hearts and way of life, this is what crossing the line means. God’s mercy is freely given and is to be freely received by all, not forced.\n\nNow and always, God longs to heal, renew, forgive and gather us under his loving care and guidance to reflect more of his image in the world. How do we reflect God’s image and likeness? It is by doing the will of God as Jesus reiterates in the later part of the gospel of today when his mother, brothers and sisters came looking for him:   “Whoever does the will of God is my brother and sister and mother.” (Mark 3:35).\n\nIt is God’s will that we submit ourselves, will and hearts to his word and to Jesus his only begotten Son whom he sent to the world to show us the example to follow.   “For this is the will of my Father, that everyone who sees the Son and believes in him may have eternal life, and I shall raise him [on] the last day.” (John 6:40).\n\nAs the tides turn in our world, we have the chance to infuse the culture of faith and mercy once again upon our world as witnesses of the merciful Jesus so that those who feel lonely, marginalized, vulnerable, hopeless, anxious and depressed will through our witness open their hearts to the redeeming and saving love of God. The Jesus who walked around tirelessly in his days caring for the people is still much with us in our difficult world today of wars, hunger, insecurity, poverty and uncertainties, his strength will see us through if we place our trust in him in every life’s situation.",
   "father": "Welcome Father Daniel Johann",
   "source": "Source of reflection: Sister Priscilla Aliu, SNDdeN, https://www.sndden.org/tenth-sunday-in-ordinary-time-sister-priscilla-aliu-sndden/\nSource of image: \"Holy Spirit\" by Gian Lorenzo Bernini (in Saint Peter's Basilica), foto by Dnalor 01, CC BY-SA 3.0 at, https://commons.wikimedia.org/w/index.php?curid=32470774",
   "reading1": "Gn 3:9-15",
   "reading2": "2 Cor 4:13-5:1",
   "reading3": "Mk 3:20-35",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1717904690507",
         "date": "9 June",
         "description": "Join us for our **social gathering** for the month of June today after Mass! Kindly consider helping the team with the set-up for the social before Mass (12:30), and bring something edible to share if possible.\nIn addition, there will be **children's church** during the Liturgy of the Word part of the Mass."
      }
   ],
   "colors": {
      "color1": "#BF8C40",
      "color2": "#000",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends,\n\njoin us for Mass, children's church and social gathering this Sunday, June 9!\nFurther info on the Mass readings as well as ways to help are included in the bulletin.",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2024-06-09-tenth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2024-06-09-tenth-sunday-in-ordinary-time.markdown"
}