{
   "date": "August 4, 2024",
   "dateChanged": "2024-08-03 01:56:37 +02:00",
   "image": {
      "enabled": true,
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/The_Last_Supper_%281886%29%2C_by_Fritz_von_Uhde.jpg/800px-The_Last_Supper_%281886%29%2C_by_Fritz_von_Uhde.jpg",
      "layout": "left",
      "size": 65
   },
   "title": "Eighteenth Sunday in Ordinary Time",
   "text": "*Jesus said to them, “I am the bread of life;\nwhoever comes to me will never hunger,\nand whoever believes in me will never thirst.*\n\n(John 6:35)\n\n###Bread and Faith\n\nOur work life, our love life, and our food life — these phrases pretty well cover the range of human existence; and if we stretch “love life” to include our faith life (since faith informs the commitments of our loving), the coverage is complete. Within this context, it is fascinating how much of our life is linked to the food part. We are indeed what we eat; physically we become what we consume. Our family and social relationships are most frequently experienced around meals.\n\nFor many of us, much of our work life — from farming, through processing, packaging, advertising, retailing, to cooking and serving — is food-related. And the physical side of this food life is a natural symbolic expression of our mental and spiritual life. Disorders related to the need to please others or to take charge of one's life can result in anorexia and bulimia.\n\nGoing deeper, religious literature speaks easily of our appetite for wisdom and understanding as a hunger and thirst of the spirit, satisfied only by a fitting relationship with the source of all, God. Biblical examples of this abound: see, for example Psalm 23, Isaiah 49:10, Proverbs 9:5, or Sirach 15:3. The rabbis drew on this tradition when they interpreted the deeper meaning of the manna of Exodus as symbolic of the Torah, the word of God which satisfies the hunger of the human spirit for wisdom and understanding.\n\nThese realities of human food, life and biblical imagery help us grasp the power of Jesus’ assertion that he is the true bread from heaven. This is not first of all a reference to the Eucharist. It is first an application to Jesus of the sapiential (or wisdom) understanding of the manna tradition.\n\nIt is he — known through faith as the Word of God made flesh and revealed most fully in his death and resurrection — who can satisfy our deepest hunger to know what life means and who we are in order to live it. Understood that way, the further application to Eucharist means even more. ",
   "father": "Welcome Father Eckhard",
   "source": "Source of reflection: © 2001, Dennis Hamm, SJ - https://liturgy.sluhostedsites.org/18OrdB080424/theword_hamm.html\nSource of image: \"The Last Supper\" (1886), Fritz von Uhde - https://en.wikipedia.org/wiki/File:The_Last_Supper_(1886),_by_Fritz_von_Uhde.jpg",
   "reading1": "Ex 16:2-4, 12-15",
   "reading2": "Eph 4:17, 20-24",
   "reading3": "Jn 6:24-35",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1722722400000",
         "date": "4 August",
         "description": "Our **Social Gathering** for the month of August comes off after Mass. If you can, kindly give the team a hand with the set-up - from 12:30 on - this is a much-needed service in order to keep our regular social gatherings alive! Also, bring something edible to share with the community. "
      }
   ],
   "colors": {
      "color1": "#4D1E19",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends, here's our bulletin for August 4, 2024.\nYou are warmly invited to join the social gathering after Mass - together with a kind reminder that this much-loved tradition can only go on with your contribution: Bringing a dish or snack to share, and of course volunteers helping the team with setting up the social! Thank you for considering...",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2024-08-04-eighteenth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2024-08-04-eighteenth-sunday-in-ordinary-time.markdown"
}