{
   "date": "August 25, 2024",
   "dateChanged": "2024-08-24 11:40:03 +02:00",
   "image": {
      "enabled": true,
      "src": "https://www.verbumdeiphilippines.com/uploads/1/0/7/7/10777735/p78_1.png",
      "layout": "left",
      "size": 50
   },
   "title": "Twenty-first Sunday in Ordinary Time",
   "text": "**Jesus then said to the Twelve, \"Do you also want to leave?\"\nSimon Peter answered him, \"Master, to whom shall we go?\nYou have the words of eternal life.\nWe have come to believe\nand are convinced that you are the Holy One of God.\"** *John 6:67-69*\n\n---\n\nGood confrontation is hard to find these days. There is definitely confrontation out there, but it's mostly forms so vile that the people in its path flee or become so enraged themselves that they become entrapped in it. \n\nWhat happened to good confrontation? \n\n[...]\nHow many times in life are we pushed or nudged into growth?\n\nAll those times when we aren't sure we can give the presentation, run the 5k, read scripture in front of everyone at church, deliver the baby, pass the exam, rappel down the wall, swim the whole length of the pool, or speak up for ourselves; and someone pushes us to gather up our strength and we give it a go. When we wouldn't have on our own. We just needed a little confrontation, some direct pressure to move forward. \n\nIn John 6:60-69, that's what Jesus was doing. After the disciples complained that following Jesus was so hard that they didn't understand why anyone would do it, Jesus said, \"Does this shock you?\"  Jesus laid it out for them and says that he's got \"Spirit and life,\" which is the most important thing of all. Many of his followers left and gave it all up. Because it was hard and they were being confronted with that inevitability. But for those who stayed, it solidified their dedication to Jesus who has \"the words of eternal life.\" It made them come to terms with the fear of the difficulty: that it was worth it. That life following Jesus provided meaning and growth, even when it was hard. \n\nNotice that Jesus doesn't chase after the people who left. He lets them go on their own accord. But he doesn't pretend that following him will be easy for the sake of boosting his numbers either. He knows that what he is offering will both inspire and require growth in the most important ways, and he's willing to be honest about that.\n\nWhen have you been faced with a good confrontation of your faith?\n\nWhen have you provided a good confrontation to support the growth of someone else’s faith? How has that brought you into the “Spirit and life” that Jesus invites us into?",
   "father": "Welcome Father Bernward",
   "source": "Source of reflection (shortened): Rev. Martha Slocombe, Creighton University, https://onlineministries.creighton.edu/CollaborativeMinistry/082524.html\nSource of image: https://www.verbumdeiphilippines.com/reflections/daily-guidelines-august-26-2018",
   "reading1": "Jos 24:1-2a, 15-17, 18b",
   "reading2": "Eph 5:21-32",
   "reading3": "Jn 6:60-69",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1725141600000",
         "date": "1 September",
         "description": "The **Social Gathering** for the month of September will not take place on Sept 1, but is moved to the following Sunday, 9th of September, when hopefully most of our members are back from their holiday travels."
      }
   ],
   "colors": {
      "color1": "#B3E5C3",
      "color2": "#CC79D2",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2024-08-25-twenty-first-sunday-in-ordinary-time.html"
   },
   "saveAs": "2024-08-25-twenty-first-sunday-in-ordinary-time.markdown"
}