{
   "date": "November 10, 2024",
   "dateChanged": "2024-11-10 11:08:33 +02:00",
   "image": {
      "enabled": true,
      "src": "https://diglib.library.vanderbilt.edu/cdri/jpeg/Mafa060.jpg",
      "layout": "left",
      "size": 60
   },
   "title": "Thirty-second Sunday in Ordinary Time",
   "text": "*Calling his disciples to himself, [Jesus] said to them,\n\"Amen, I say to you, this poor widow put in more\nthan all the other contributors to the treasury.\nFor they have all contributed from their surplus wealth,\nbut she, from her poverty, has contributed all she had,\nher whole livelihood.\"* \n\n(Mk 12:43-44)\n\n.\n\n---\n\n.\n\n**Words of the Holy Father**\n\nThe Gospel presents us with this striking contrast: the rich who give from their surplus wealth to make themselves seen, and a poor woman, who without seeming to, offers every little bit she has.\n\nTwo symbols of human attitudes. Jesus watches the two scenes. And it is this very verb — “to watch” — that sums up his teaching: “we must watch out for” those who live their faith with duplicity, like the scribes, so as not to become like them; whereas we must “watch” the widow, and take her as a model. (…) Jesus praises the fact that this widow puts all she has into the treasury. She has nothing left, but finds her everything in God. She is not afraid of losing the little she has because she trusts in God’s abundance, and God’s abundance multiplies the joy of those who give. (…) \n\nThis is why Jesus proposes her as a teacher of faith, this woman: she does not go to the Temple to clear her conscience, she does not pray to make herself seen, she does not show off her faith, but she gives from her heart generously and freely. The sound of her few coins is more beautiful than the grandiose offerings of the rich, since they express a life sincerely dedicated to God, a faith that does not live by appearances but by unconditional trust. Let us learn from her. \n\n(Angelus, 7 November 2021)\n",
   "father": "Welcome Father Bernward",
   "source": "Source of reflection: Vatican News \"Word of the Day\" for Nov 10, 2024, https://www.vaticannews.va/en/word-of-the-day.html\nSource of image: JESUS MAFA. The Widow's Mite, from Art in the Christian Tradition, a project of the Vanderbilt Divinity Library, Nashville, TN. https://diglib.library.vanderbilt.edu/act-imagelink.pl?RC=48392 [retrieved November 10, 2024]. Original source: http://www.librairie-emmanuel.fr.",
   "reading1": "1 Kgs 17:10-16",
   "reading2": "Heb 9:24-28",
   "reading3": "Mk 12:38-44",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1731233829902",
         "date": "10 November",
         "description": "**Parish Team Meeting**: Our Parish Team, i.e. the group of those wishing to help with to the organization and coordination of activities of our community, meets after today's Mass in the room next to the sacristy. These meetings tend to address current issues, reflect on the way forward for our community, and plan upcoming events at ICCH. **We warmly invite anyone of our members** who is interested in contributing to join us!"
      }
   ],
   "colors": {
      "color1": "#444D19",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends,\n\nOur bulletin for November 10, 2024 is now online.\n\nAfter Mass, meeting of the Parish Team. Everyone interested, please join us!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2024-11-10-thirty-second-sunday-in-ordinary-time.html"
   },
   "saveAs": "2024-11-10-thirty-second-sunday-in-ordinary-time.markdown"
}