{
   "date": "April 13, 2025",
   "dateChanged": "2025-04-12 01:36:17 +02:00",
   "image": {
      "enabled": true,
      "src": "https://diglib.library.vanderbilt.edu/cdri/jpeg/Swanson-entry-into-the-city.jpg",
      "layout": "left",
      "size": 60
   },
   "title": "Palm Sunday of the Lord's Passion",
   "text": "### King? Really?\n\nThis Sunday, called “Palm Sunday of the Lord's Passion” has two halves to it, palms and passion. They stand in jarring contrast to each other. Let us look.\n\n***1) The palms, thrown from the people’s hands, proclaim Jesus’ kingship.***\n\nIn the Mass, we hold palms during the ritual procession, just as those did who lined the road long ago. This opening part of this Mass is more than just another historical reenactment; it is a proclamation of Jesus as king. This moment is the first half of the jarring contrast.\n\nYou may never have dwelt on this kingly aspect, but there are multiple clues in the First Gospel (the one that takes place just before the palm procession itself). First, he rode on a colt, the animal that was used for royalty’s entrance into a city. The disciples spread their cloaks over the colt’s back as they would do for a king.\n\nCrowds along the way greet Jesus as a royal hero. They smooth their coats on the roadway, then cover these with palm branches cut from the fields. This was in order to soften the pathway for the kingly one and to keep the dirt off of him. They cry out, “Blessed is he who comes in the name of the Lord!”\n\n***2) The soldiers, mocking and doing their best to destroy his kingship***\n\nThe Mass itself and its Passion Reading commemorate the ridiculed and foolish tale of Jesus’ kingship. Soldiers tie him up and yell, “King of the Jews,” to deride this poor, ridiculous captive. They jam a “royal” crown made of thorns on his head. They wrap a fake robe of purple around him (the color reserved for kings because of the rarity of this hew in those days).\n\nThey spit on him. They strike him. They laugh. They make a tortured fool out of this great “king.”\n\nThe First Reading had already told us why such torture happened. Because the King chose it. The reading says,\n\n*I have not rebelled, I have not turned around. I gave my back to those who beat me, my cheeks to those who plucked my beard; my face I did not shield from buffets and spitting.*\n\nHave you ever been made a fool in front of people? Do you remember how it felt? You or I would have cried out, “My God, why have you abandoned me?” The Responsorial Psalm says exactly these words, and Jesus will say them from the cross.\n\nBut are these the words of a king? Does such a total surrender represent kingly action?\n\nNo?\n\nJesus, king of kings, “did not regard equality with God as something to cling to”—for safety or honor or for whatever else. As the greatest king he emptied himself out, became like a slave, obedient even to death on the cross (Second Reading). This was in allegiance to God and in service of the people.\n\nWhat a jarring contrast. It is put to rest because Jesus knew who he was, even under the worst duress and strife. He was, no matter what,\n\n*the one who loves*. \n\nIs this our imagined Kingly greatness? No. It is the opposite.\n\nThe real basis of rulership is service to God’s people, no matter what. The good ruler pulls a kingdom together and makes it safe, a place of abundance. If he/she accomplish such a goal (and in the USA we are experiencing this) no kingly suffering could be too great.\n\nPalm/Passion Sunday is a large-scale revelation of kingship’s real meaning.\n\nLove.",
   "father": "Welcome Father Daniel",
   "source": "Source of reflection: © 2025, John B. Foley, SJ, https://liturgy.sluhostedsites.org/PassionC041325/reflections_foley.html\nSource of image: Swanson, John August. Entry into the City, from Art in the Christian Tradition, a project of the Vanderbilt Divinity Library, Nashville, TN. https://diglib.library.vanderbilt.edu/act-imagelink.pl?RC=56544 [retrieved April 12, 2025]. Original source: Estate of John August Swanson, https://www.johnaugustswanson.com/",
   "reading1": "Lk 19:28-40 | Is 50:4-7",
   "reading2": "Phil 2:6-11",
   "reading3": "Lk 22:14—23:56",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1744495200000",
         "date": "13 April",
         "description": "Mass starts outside. Kindly bring your own \"palms\" (green leaves) if possible. After a joint start, our youngest members are invited to join **Children's Church**."
      },
      {
         "epoch": "1744495200000",
         "date": "13 April",
         "description": "After Mass, opportunity for **confessions**."
      }
   ],
   "colors": {
      "color1": "#9D0000",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 2
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Here's our bulletin for Palm Sunday, April 13.",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2025-04-13-palm-sunday-of-the-lords-passion.html"
   },
   "saveAs": "2025-04-13-palm-sunday-of-the-lords-passion.markdown"
}