{
   "date": "August 10, 2025",
   "dateChanged": "2025-08-10 01:00:10 +02:00",
   "image": {
      "enabled": true,
      "src": "https://christian.art/wp-content/uploads/2022/02/luke-12-35-38-reflection-jan-kruseman.jpg",
      "layout": "left",
      "size": 50
   },
   "title": "Nineteenth Sunday in Ordinary Time\n",
   "text": "The Readings for today continue the theme of Choices and Values, but with a certain twist. Our \nchoices must be based on faith, with the ultimate goal being our salvation. Today, we hear \nabout God's Plan of Salvation, the divine plan for all mankind. You see, God did not create \nmankind and then leave us to ourselves. His goal was, and still is, to bring us back to the Father \nat the time of death and then collectively at the end of time when He will honor all mankind \naccording to what we have accomplished here on earth. So, let us see how the readings fit into \nthis picture.    \nThe First Reading is from the Book of Wisdom (18:6-9). This passage is a reflection on the \nevents of the first Passover, the liberation of the Israelites from Egypt during the time of Moses. \nIt is the primary event in the history of the Jews, who were the first to accept God directing their \nlives in order to set in motion the expanded works of His Plan. This is the meaning of the last \nline of this passage: \"...putting into effect with one accord the divine institution (plan).\"    \nThe Responsorial Psalm is (33:1, 12, 18-22). It is a meditation on the events mentioned above. \nHere the psalmist praises God and takes pride in the fact that he is part of \"the people He (God) \nhas chosen for his own inheritance.\" The last two sentences of this portion of the Psalm reflect \non those who have chosen the spiritual values that are in line with God's Plan for them.    \nThe Second Reading is from the Letter to the Hebrews (11:1-2, 8-19). In this section of \nHebrews, the author is explaining the many characters that were instrumental in affecting God's \nPlan of Salvation among the Jews. Here, he mentions Abraham, Isaac and Jacob, Patriarchs of \nancient Judaism, whose faith in God overcame many obstacles and tests to accomplish their part \nof God's Plan even though \"they did not receive what had been promised but saw it and \ngreeted it from afar.\" Today, we might not see what God has in mind for us; but if we are faithful \nto Him, we will eventually see and enjoy it.   \nThe Gospel Reading is from the Gospel of St. Luke (12:32-48). This passage is a continuation \nfrom last week. In it, Jesus is again explaining that the choices and values we live by will \ndetermine our place in the Kingdom. Although Jesus is speaking in terms and ways that were \neasily understood by the people of His time, His instructions and advice are just as applicable to \nus today. We should be able to translate this “word picture” into the language of today for our \nunderstanding; but the result will be the same.    \nAs we said last week, God wants us to enjoy life and the things that He created for us; however, \nthese must be in accord with our faith and with his Plan of Salvation for us. We do much to \neducate ourselves and our children to face the world and its many complexities, so why is it that \nwe don't spend time in trying to better understand what God wants from each of us? Something \nto think about during your prayer time this week!",
   "father": "Welcome Father Chinedu",
   "source": "Source: https://stclareroseville.org/commentary\nImage: The wise and the foolish virgin, Painted by Jan Adam Kruseman (1804-1862).",
   "reading1": "Lk 12:32-48",
   "reading2": "Hebrews 11:1-2, 8-19",
   "reading3": "Wis 18:6-9",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [],
   "colors": {
      "color1": "#79D2A6",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 15,
         "size": 12.5,
         "paragraphMargin": 20
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2025-08-10-nineteenth-sunday-in-ordinary-time.html"
   },
   "saveAs": "2025-08-10-nineteenth-sunday-in-ordinary-time.markdown"
}