{
   "date": "September 14, 2025",
   "dateChanged": "2025-09-13 12:39:49 +02:00",
   "image": {
      "enabled": true,
      "src": "https://diglib.library.vanderbilt.edu/cdri/jpeg/godloved2846vbxq.jpg",
      "layout": "left",
      "size": 52.5
   },
   "title": "Feast of the Exaltation of the Holy Cross ",
   "text": "The Feast of the Exaltation of the Holy Cross, also known as the Feast of the Triumph of the Cross, commemorates three historical events: the discovery of the True Cross in 326, its initial exaltation for public veneration in 335, and the recovery of the Cross from the Persians in 628. Nowadays, this feast also celebrates the boundless impact of Christ’s Cross upon all of creation.\n\n[...]\n\nAlthough we commemorate these three historical events today, the core of our celebration is not the physical wood of the Cross or the holy sites where Jesus died and was buried. Our primary focus is the infinite love shown through the selfless and perfect Sacrifice of the Son of God and the boundless mercy that has poured forth upon the world as a result. The Cross itself is a cruel instrument of torture and death. The fact that it is now the symbol of God’s perfect love only further magnifies that love and showcases God’s infinite power to use the worst for the best: to use death to bring life and to transform the greatest act of cruelty ever known into the greatest act of mercy ever bestowed upon the world.\n\nThe Cross of Christ must permeate each one of us, transforming us and making us new. First and foremost, this happens when we open ourselves to the infinite mercy of God flowing from that selfless Sacrifice. It also occurs when we allow every one of our sufferings, the injustices we endure, the crosses, hardships, and most undesirable aspects of our lives to share in the redemptive power of Christ. We do this when we embrace Jesus’ commands to share in His sufferings, unite them with His own, and allow Him to bear an abundance of good fruit through us. “Whoever wishes to come after me must deny himself, take up his cross, and follow me. For whoever wishes to save his life will lose it, but whoever loses his life for my sake will find it” (Matthew 16:24–25).\n\nAs we commemorate the triumph of Christ’s Cross, call to mind the crosses you bear each day. More often than not, when faced with crosses, we seek a way out, succumb to self-pity, and are often tempted by anger and despair. Instead, try to allow Jesus to enter those crosses, transform them, and use them for His glory, your good, and the good of others. Crosses in life should not be avoided; they must be transformed. Although the suffering may remain, it must become redeemed suffering, thus bearing an abundance of good fruit in ways that only God can accomplish.\n\n*Prayer: Most glorious and triumphant Lord, You gave Your life for the salvation of my soul, using the most horrific act of cruelty as the means of Your redeeming grace. I open myself to that grace today and pray that You bestow it in superabundance. I also pray that I will have the courage and wisdom to embrace my crosses every day of my life, uniting them to Your Cross, and trusting that You will use these sacrifices as a means of the further bestowal of Your love on the world. Saving Cross of Christ, have mercy on me. Jesus, I trust in You.*",
   "father": "Welcome Father Daniel",
   "source": "Source of reflection: © My Catholic Life! Inc., shortened from: https://mycatholic.life/saints/saints-of-the-liturgical-year/september-14the-exaltation-of-the-holy-cross-of-our-lord-jesus-christ/\nSource of image: For God So Loved the World, from Art in the Christian Tradition, a project of the Vanderbilt Divinity Library, Nashville, TN. https://diglib.library.vanderbilt.edu/act-imagelink.pl?RC=59702 [retrieved September 12, 2025]. Original source: http://denazaret.wordpress.com/2010/04/13/juan-3-16-21-vino-la-luz-al-mundo/.",
   "reading1": "Num 21:4b-9",
   "reading2": "Phil 2:6-11",
   "reading3": "John 3:13-17",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1757800800000",
         "date": "14 September",
         "description": "At the end of the summer school holidays, we'll gather after Mass for our first big **social gathering** in the community rooms of our church St. Bartholomäus. Kindly bring some food to share with everyone if by any means possible. Also, volunteers for setting up the social (meeting at 12:30) will be very much appreciated!"
      },
      {
         "epoch": "1757800800000",
         "date": "14 September",
         "description": "Children are invited to join a \"back to school\" themed episode of **Children's Church** during the Liturgy of the Word part of our Mass. Small children may of course be accompanied by a parent if preferred."
      }
   ],
   "colors": {
      "color1": "#CECA2F",
      "color2": "#000",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "Dear friends,\nHere's our bulletin for September 14.\nNow that most of us are back from travels, the new academic year is about to start, we want to gather for our first \"Social Sunday\", complete with Children's Church and social gathering after Mass. Bring a dish to share if possible, and consider coming half an hour early to help setting everything up!",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2025-09-14-feast-of-the-exaltation-of-the-holy-cross.html"
   },
   "saveAs": "2025-09-14-feast-of-the-exaltation-of-the-holy-cross.markdown"
}