{
   "date": "November 2, 2025",
   "dateChanged": "2025-11-01 10:15:30 +02:00",
   "image": {
      "enabled": true,
      "src": "https://diglib.library.vanderbilt.edu/cdri/jpeg/CProp27bw57195.jpg",
      "layout": "left",
      "size": 30
   },
   "title": "Commemoration of All the Faithful Departed\n(All Souls)",
   "text": "###A Fresh Surprise of Love\n\nDeath is one of the toughest areas for spirituality, yet also the most wonderful.\n\nHow can our beloved ones, so filled with the spark of life, so suddenly be gone from us?\n\nAfterlife? Let us face it, the culture of the Western world is filled with unbelief about afterlife. [...]\nHere is a poem about life and death. The poet is Rabindranath Tagore, former poet laureate of India. This poem is #71 in his Crossing.** He was not a Catholic or a Christian. Yet what he wrote can awaken those of us who are.\n\n    I remember my childhood when the sunrise,\n    like my play-fellow,\n    would burst in to my bedside\n    with its daily surprise of morning;\n    when the faith in the marvelous bloomed\n    like fresh flowers in my heart every day,\n    looking into the face of the world\n               in simple gladness;\n    when insects, birds and beasts,\n              the common weeds,\n              grass and the clouds\n    had their fullest value of wonder;\n    when the patter of rain at night brought\n    dreams from the fairyland,\n    and mother’s voice in the evening\n    gave meaning to the stars.\n\n    And then I think of death,\n    and the rise of the curtain and the new morning\n    and my life awakened\n    in its fresh surprise of love.\n\nI am always thrilled when I come to the last four lines. I expect the word “death” to mean cancellation of the beautiful, the marvelous, the meaning, the mothering that most of us reach for. This poet knew better. Love undergirds everything, even death.\n\nListen to the priest’s opening prayer this Sunday of All Souls.\n\n    As our faith in your Son,\n    raised from the dead, is deepened\n    so may our hope for resurrection for your departed servants\n    also find new strength.\n\nTo put it another way, please tie life after death, our hope, tightly and irrevocably to the resurrection of Jesus.\n\nEvery “fresh surprise of love” in our lives is Christ-given. Every one consists of fondness-enfleshed, like the patter of rain at night. If Christ was love enough to last through death, then let us adhere to that love, even as we suffer or die.\n\nIt is within us, no matter how many losses we have. No matter how harsh the world may act, still, in the depth of each and every person, there dwells the source of life, the place of home where God resides.\n\nSo, how can a friend or family member be filled with the spark of life and then have it suddenly go out? By being welcomed directly into the arms of God even as Jesus himself was when he died. God helps us to full, complete readiness for his arms, something we have traditionally called purgatory. It can be compared to loving parents helping their child to grow.\n\nTo say it simply, “life after death” is nothing less and nothing more than love. And God is love. ",
   "father": "Welcome Father Eckhard",
   "source": "Source of reflection: © 2014, John B. Foley, S. J. All rights reserved. https://liturgy.sluhostedsites.org/AllSouls110225/reflections_foley.html\nSource of image: Souls Being Carried Up to Heaven. http://diglib.library.vanderbilt.edu/act-imagelink.pl?RC=59051",
   "reading1": "Wis 3:1-9",
   "reading2": "Rom 5:5-11",
   "reading3": "John 6:37-40",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1762038000000",
         "date": "2 November",
         "description": "For **All Souls Day**, we want to read out the names of those who have entered the life of eternity throughout the last year - please write down the names of your loved ones that passed in the intercessions book. After Mass, a joint **visit to the cemetery** next to the church is suggested as well."
      },
      {
         "epoch": "1762642800000",
         "date": "9 November",
         "description": "Our monthly **Social Gathering** comes off after Mass. Additional help with the preparations is very much appreciated by the team."
      }
   ],
   "colors": {
      "color1": "#32194D",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 12,
         "size": 11,
         "paragraphMargin": 2
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2025-11-02-commemoration-of-all-the-faithful-departed-all-souls.html"
   },
   "saveAs": "2025-11-02-commemoration-of-all-the-faithful-departed-all-souls.markdown"
}