{
   "date": "January 18, 2026",
   "dateChanged": "2026-01-17 03:18:07 +02:00",
   "image": {
      "enabled": true,
      "src": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiNoYxXzrXgxSZvoUoi9rw36DI6172SXB1IZPS8wVtHQu9MIbp1imTjQPAFaW1rA6p6SvD-SuNdAkJ196PiPaY2Mbwaw8dhV84WI6oSByrr39GHDw6K_xT3Bedw1yrwDk_qHjvbSoxaTGxg/s640/behold-the-lamb-of-god.jpg",
      "layout": "left",
      "size": 35
   },
   "title": "Second Sunday in Ordinary Time",
   "text": "###Failure\n\nThe First Reading gives us something rare in Scripture: a dialogue between God the Father and the Messiah he sent. But if you look at the verse numbers of our First Reading, you will see that Verse 4 has been omitted.\n\nThe preceding Verse 3 is God’s line to the Messiah. My way of phrasing it would be, *“you are my servant, and you will be a spectacular success; people will be able to see the glory of God by looking at you.”*\n\nThis is a powerful expression of praise and affirmation, isn’t it?\n\nBut guess how the Messiah responds to God in the omitted Verse 4?\n\nIn the first of his two lines in Verse 4, the Messiah says (in my way of phrasing it), *“I have labored in vain. I have used all my strength, and it has all been for nothing.”*\n\nThis line is a powerful expression of failure, isn’t it?\n\nYou can see why someone might have thought Christ’s mission was a failure. The people passing by Christ on the cross certainly didn’t see the glory of God in him then! And by the time of his death, the work of Christ’s life had come only to this: he had a handful of disciples and a few women as hangers-on. If the goal was to bring salvation to the world, you can see that this result would look like total failure.\n\nBut here is the gist of what God says in Verses 5-6, in response to the Messiah’s expression of failure in Verse 4:\n\n*You are glorious in the sight of the Lord, and God is your strength. Just saving Israel is too small a success for you; you will bring salvation to all the ends of the earth.*\n\nThe first communities of Christians and all the apostles were Jewish. By now there are Christian communities in every non-Jewish part of the earth, too. And so Christ’s mission to bring salvation to the Jews and the Gentiles was a glorious success, as in the First Reading God predicted it would be.\n\nBut all that success came only after the death of the Messiah.\n\nOur success, like our glory, needs to be through God’s strength, in God’s sight, and in God’s time. And that is why, in the second of his two lines in the omitted Verse 4, the Messiah says, *“my judgment is with the Lord, and my work is with my God.”* ",
   "father": "Welcome Father Eckhard",
   "source": "Source of reflection: © 2020, Eleonore Stump, https://liturgy.sluhostedsites.org/2OrdA011826/reflections_stump.html\nSource line 2. (this empty space is for the pencil icon, it's not printed on paper!) ->",
   "reading1": "Is 49:3, 5-6",
   "reading2": "1 Cor 1:1-3",
   "reading3": "John 1:29-34",
   "newsletter": "infoheidelberg@internationalcatholiccommunity.com",
   "appointments": [
      {
         "epoch": "1768690800000",
         "date": "18 January",
         "description": "Meeting of the **Parish Team** and interested members of our community after Mass, at 14:20 in the upper rooms of the parish hall."
      },
      {
         "epoch": "1768690800000",
         "date": "18 January",
         "description": "For the opportunity for confessions this month, kindly refer to our announcement at Mass (18th or 25th)."
      }
   ],
   "colors": {
      "color1": "#194D28",
      "color2": "#FFF",
      "border": "#FFF"
   },
   "fonts": {
      "text": {
         "family": "Georgia",
         "lineHeight": 13.5,
         "size": 12,
         "paragraphMargin": 5
      }
   },
   "publish": {
      "icch": true,
      "facebook": true,
      "facebookMessage": "",
      "htmlLink": "http://www.international-catholic-community-heidelberg.com/bulletins/2026-01-18-second-sunday-in-ordinary-time.html"
   },
   "saveAs": "2026-01-18-second-sunday-in-ordinary-time.markdown"
}